MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_eth.h
/**
  ******************************************************************************
  * @file    stm32c5xx_hal_eth.h
  * @brief   Header file of ETH (Ethernet) HAL module.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2026 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  *********************************************************************************************************************
  */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef STM32C5XX_HAL_ETH_H
#define STM32C5XX_HAL_ETH_H

#ifdef __cplusplus
extern "C" {
#endif /* __cplusplus */

/* Includes ------------------------------------------------------------------*/
#include "stm32c5xx_hal_def.h"
#include "stm32c5xx_ll_exti.h"
#include "stm32c5xx_ll_sbs.h"

/** @addtogroup STM32C5XX_HAL_Driver
  * @{
  */
#if defined(ETH1)

/** @defgroup ETH ETH
  * @{
  */
/* Exported constants --------------------------------------------------------*/
/** @defgroup ETH_Exported_Constants HAL ETH constants
  * @{
  */
/** @defgroup ETH_Peripheral_Global_Params ETH peripheral global parameters
  * @{
  */
#ifndef USE_HAL_ETH_MAX_TX_CH_NB
#define USE_HAL_ETH_MAX_TX_CH_NB         ETH_NB_OF_TX_CHANNEL     /*!< Number of available ETH Tx DMA channels */
#endif /* USE_HAL_ETH_MAX_TX_CH_NB */

#ifndef USE_HAL_ETH_MAX_RX_CH_NB
#define USE_HAL_ETH_MAX_RX_CH_NB         ETH_NB_OF_RX_CHANNEL     /*!< Number of available ETH Rx DMA channels */
#endif /* USE_HAL_ETH_MAX_RX_CH_NB */
/**
  * @}
  */

/** @defgroup ETH_Frame_Settings ETH frame settings
  * @{
  */
#define HAL_ETH_MAX_PACKET_SIZE_BYTE          (1528UL)            /*!< Ethernet Maximum Packet Size in bytes unit
                                                                       (ETH_HEADER + 2*VLAN_TAG + MAX_ETH_PAYLOAD
                                                                       + ETH_CRC) */
#define HAL_ETH_HEADER_SIZE_BYTE              (14UL)              /*!< Ethernet Header Size in bytes unit
                                                                       (6 byte Dest addr, 6 byte Src addr, 2 byte
                                                                       length/type) */
#define HAL_ETH_CRC_SIZE_BYTE                 (4UL)               /*!< Ethernet CRC Size in bytes unit */
#define HAL_ETH_VLAN_TAG_SIZE_BYTE            (4UL)               /*!< VLAN Tag Size in bytes unit (Optional 802.1q) */
#define HAL_ETH_DOUBLE_VLAN_TAG_SIZE_BYTE     (8UL)               /*!< Double VLAN Tag Size in bytes unit (Optional
                                                                       802.1q) */
#define HAL_ETH_MIN_PAYLOAD_SIZE_BYTE         (46UL)              /*!< Minimum Ethernet Payload Size in bytes unit */
#define HAL_ETH_MAX_PAYLOAD_SIZE_BYTE         (1500UL)            /*!< Maximum Ethernet Payload Size in bytes unit */
#define HAL_ETH_JUMBO_FRAME_PAYLOAD_SIZE_BYTE (9000UL)            /*!< Jumbo Frame Payload Size in bytes unit */
/**
  * @}
  */

/** @defgroup ETH_Channel_Identifiers ETH Tx and Rx channel identifiers
  * @{
  */
#define HAL_ETH_TX_CHANNEL_0             0x00000001UL              /*!< ETH Tx Channel 0 id         */
#define HAL_ETH_TX_CHANNEL_ALL           0x00000001UL               /*!< ETH All Tx Channels         */
#define HAL_ETH_RX_CHANNEL_0             0x00010000UL              /*!< ETH Rx Channel 0 id         */
#define HAL_ETH_RX_CHANNEL_ALL           0x00010000UL               /*!< ETH All Rx Channels         */
#define HAL_ETH_CHANNEL_ALL              (HAL_ETH_TX_CHANNEL_ALL | \
                                          HAL_ETH_RX_CHANNEL_ALL)  /*!< ETH All Tx and Rx Channels  */
/**
  * @}
  */

/** @defgroup ETH_Queue_Indexes ETH Tx and Rx queue indexes
  * @{
  */
#define HAL_ETH_TX_Q0                    0x00000000UL              /*!< ETH Tx Queue0 Index */
#define HAL_ETH_RX_Q0                    0x00000000UL              /*!< ETH Rx Queue0 Index */
/**
  * @}
  */

/** @defgroup ETH_Error_Code ETH peripheral error codes
  * @brief Error codes for the Ethernet (ETH) peripheral.
  *
  * These constants define the possible error codes returned by the Ethernet
  * (ETH) peripheral HAL layer. They are typically used as bitmasks, allowing
  * multiple errors conditions to be reported simultaneously.
  *
  * @note These error are synchronously reported through @p p_error_cb Callback.
  * @note Use @ref HAL_ETH_GetLastErrorCodes to retrieve the last error code.
  * @{
  */
#define HAL_ETH_ERROR_NONE               0x00000000UL                 /*!< No error                */
#define HAL_ETH_ERROR_FBE                ETH_DMACSR_FBE               /*!< Fatal Bus Error          */
#define HAL_ETH_ERROR_CDE                ETH_DMACSR_CDE               /*!< Context Descriptor Error */
/* Errors set when a bus error occurs during Rx DMA operation */
#define HAL_ETH_ERROR_FBE_DMA_RX_RD      (0x1UL << ETH_DMACSR_REB_Pos) /*!< Bus Fault Error during read transfer
                                                                                 by Rx DMA */
#define HAL_ETH_ERROR_FBE_DMA_RX_AC      (0x2UL << ETH_DMACSR_REB_Pos) /*!< Bus Fault Error during descriptor
                                                                                 access by Rx DMA */
#define HAL_ETH_ERROR_FBE_DMA_RX_WR      (0x4UL << ETH_DMACSR_REB_Pos) /*!< Bus Fault Error during data transfer
                                                                                 by Rx DMA */
/* Errors set when a bus error occurs during Tx DMA operation */
#define HAL_ETH_ERROR_FBE_DMA_TX_RD      (0x1UL << ETH_DMACSR_TEB_Pos) /*!< Bus Fault Error during read transfer
                                                                                 by TxDMA */
#define HAL_ETH_ERROR_FBE_DMA_TX_AC      (0x2UL << ETH_DMACSR_TEB_Pos) /*!< Bus Fault Error during descriptor
                                                                                 access by Tx DMA */
#define HAL_ETH_ERROR_FBE_DMA_TX_WR      (0x4UL << ETH_DMACSR_TEB_Pos) /*!< Bus Fault Error during data transfer
                                                                                 by Tx DMA */
#define HAL_ETH_ERROR_UNDEFINED          0x80000000UL                 /*!< Undefined or unexpected error */
/**
  * @}
  */

