MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_eth.h
/** @defgroup ETH_MAC_Event_Codes ETH MAC peripheral status events
  * @brief MAC Event codes for the Ethernet (ETH) peripheral.
  *
  * These constants define the possible events codes returned by the Ethernet
  * (ETH) peripheral HAL layer. They are typically used as bitmasks, allowing
  * multiple events conditions to be reported simultaneously.
  *
  * @note These events are synchronously reported through @p p_event_cb Callback.
  * @{
  */
/* ETH MAC Rx Tx Status Events */
#define HAL_ETH_EVENT_MAC_RWT            ETH_MACRXTXSR_RWT         /*!< Receive Watchdog Timeout Event */
#define HAL_ETH_EVENT_MAC_EXCOL          ETH_MACRXTXSR_EXCOL       /*!< Excessive Collisions Event */
#define HAL_ETH_EVENT_MAC_LCOL           ETH_MACRXTXSR_LCOL        /*!< Late Collision Event */
#define HAL_ETH_EVENT_MAC_EXDEF          ETH_MACRXTXSR_EXDEF       /*!< Excessive Deferral Event */
#define HAL_ETH_EVENT_MAC_LCARR          ETH_MACRXTXSR_LCARR       /*!< Loss of Carrier Event */
#define HAL_ETH_EVENT_MAC_NCARR          ETH_MACRXTXSR_NCARR       /*!< No Carrier Event */
#define HAL_ETH_EVENT_MAC_TJT            ETH_MACRXTXSR_TJT         /*!< Transmit Jabber Timeout Event */
/**
  * @}
  */

/** @defgroup ETH_PMT_Event_Codes ETH PMT peripheral status events
  * @brief PMT Event codes for the Ethernet (ETH) peripheral.
  *
  * These constants define the possible events codes returned by the Ethernet
  * (ETH) peripheral HAL layer. They are typically used as bitmasks, allowing
  * multiple events conditions to be reported simultaneously.
  *
  * @note These events are synchronously reported through @p p_pmt_cb Callback.
  * @{
  */
/* ETH PMT Status Events */
#define HAL_ETH_EVENT_PMT_MAGIC_PACKET   ETH_MACPCSR_MGKPRCVD    /*!< Magic Packet Received          */
#define HAL_ETH_EVENT_PMT_RWK_PACKET     ETH_MACPCSR_RWKPRCVD    /*!< Remote wake-up Packet Received */
/**
  * @}
  */

/** @defgroup ETH_LPI_Event_Codes ETH LPI peripheral status events
  * @brief LPI Event codes for the Ethernet (ETH) peripheral.
  *
  * These constants define the possible events codes returned by the Ethernet
  * (ETH) peripheral HAL layer. They are typically used as bitmasks, allowing
  * multiple events conditions to be reported simultaneously.
  *
  * @note These events are synchronously reported through @p p_eee_cb Callback.
  * @{
  */
/* ETH LPI Status Events */
#define HAL_ETH_EVENT_LPI_PLS_DOWN       0UL                     /*!< PHY Link Status is Down            */
#define HAL_ETH_EVENT_LPI_PLS_UP         ETH_MACLCSR_PLS         /*!< PHY Link Status is Up              */
#define HAL_ETH_EVENT_LPI_TX_LPI_ST      ETH_MACLCSR_TLPIST      /*!< Transmit LPI State Active          */
#define HAL_ETH_EVENT_LPI_RX_LPI_ST      ETH_MACLCSR_RLPIST      /*!< Receive LPI State Active           */
#define HAL_ETH_EVENT_LPI_TX_LPI_EN      ETH_MACLCSR_TLPIEN      /*!< Transmit LPI State Entry performed */
#define HAL_ETH_EVENT_LPI_RX_LPI_EN      ETH_MACLCSR_RLPIEN      /*!< Receive LPI State Entry performed  */
#define HAL_ETH_EVENT_LPI_TX_LPI_EX      ETH_MACLCSR_TLPIEX      /*!< Transmit LPI State Exit performed  */
#define HAL_ETH_EVENT_LPI_RX_LPI_EX      ETH_MACLCSR_RLPIEX      /*!< Receive LPI State Exit performed   */
/**
  * @}
  */

/** @defgroup ETH_Channel_Event_Codes ETH channel event codes
  * @brief Event codes for the Ethernet (ETH) channel.
  *
  * These constants define the possible events codes returned by the Ethernet
  * (ETH) channel HAL layer. They are typically used as bitmasks, allowing
  * multiple events conditions to be reported simultaneously.
  *
  * @note These events are reported through registered @p p_ch_event_cb to the user.
  * @{
  */
#define HAL_ETH_CH_EVENT_DMA_RBU         ETH_DMACSR_RBU           /*!< Receive Buffer Unavailable Event (bit[7]),
                                                                        This event indicates that there is no more
                                                                        available resources (memory) to perform the
                                                                        incoming packet reception. The Rx process is
                                                                        suspended. To resume processing Rx packets, the
                                                                        application must provide more memory to the
                                                                        driver to allow resuming Rx process of the next
                                                                        recognized incoming packet.
                                                                        This event is available ONLY for Receive
                                                                        Channels. */
#define HAL_ETH_CH_EVENT_DMA_TBU         ETH_DMACSR_TBU           /*!< Transmit Buffer Unavailable Event (bit[2]),
                                                                        This event indicates that the application owns
                                                                        the next descriptor in the Transmit list, and
                                                                        the DMA cannot acquire it. Transmission is
                                                                        suspended.
                                                                        This event is available ONLY for Transmit
                                                                        Channels. */
#define HAL_ETH_CH_EVENT_DMA_RWT         ETH_DMACSR_RWT           /*!< Receive Watchdog Timeout Event (bit[9]).
                                                                        This error is reported when a packet with
                                                                        length greater than 2,048 bytes (10,240 bytes
                                                                        when Jumbo Packet mode is enabled) is received.
                                                                        This error is reported ONLY for Receive
                                                                        Channels. */
/* ETH MTL Error Events */
#define HAL_ETH_CH_EVENT_MTL_RX_OF       ETH_MTLQICSR_RXOVFIS     /*!< MTL Receive Queue Overflow Interrupt
                                                                        Event (bit[16]).
                                                                        This event indicates that the Receive Queue had
                                                                        an overflow while receiving the packet. If a
                                                                        partial packet is transferred to the
                                                                        application, the overflow channel event
                                                                        HAL_ETH_RX_ERROR_OFL is reported. */
#define HAL_ETH_CH_EVENT_MTL_TX_OF       ETH_MTLQICSR_TXUNFIS     /*!< MTL Transmit Queue Underflow Interrupt
                                                                        Event (bit[0]).
                                                                        This event indicates that the Transmit Queue
                                                                        had an underflow while transmitting the packet.
                                                                        Transmission is suspended and an Underflow
                                                                        Error HAL_ETH_TX_ERROR_UF is reported
                                                                        to the application. */
/**
  * @}
  */

