MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_eth.h
/** @defgroup ETH_Channel_Rx_Errors ETH Rx channel errors
  * @brief Errors for the Ethernet (ETH) Rx channel.
  *
  * These constants define the possible errors returned by the Ethernet
  * (ETH) channel HAL layer. They are typically used as bitmasks, allowing
  * multiple errors conditions to be reported simultaneously.
  *
  * @note These errors are reported through registered @p p_rx_complete_cb to the user.
  * @{
  */
#define HAL_ETH_RX_ERROR_IPH             (1UL <<  3U)              /*!< IP Header Error.
                                                                        When this error is reported, it indicates
                                                                        either of the following:
                                                                        * The 16-bit IPv4 header checksum calculated by
                                                                        the MAC does not match the received checksum
                                                                        bytes.
                                                                        * The IP datagram version is not consistent
                                                                        with the Ethernet Type value.
                                                                        * Ethernet packet does not have the expected
                                                                        number of IP header bytes.
                                                                        This error is valid when IPv6 or IPv4 header
                                                                        is detected. */
#define HAL_ETH_RX_ERROR_IPC             (1UL <<  7U)              /*!< IP Payload Error.
                                                                        When this error is reported, it indicates
                                                                        either of the following:
                                                                        * The 16-bit IP payload checksum (that is, the
                                                                        TCP, UDP, or ICMP checksum) calculated by the
                                                                        MAC does not match the corresponding checksum
                                                                        field in the received segment.
                                                                        * The TCP, UDP, or ICMP segment length does not
                                                                        match the payload length value in the IP Header
                                                                        field.
                                                                        * The TCP, UDP, or ICMP segment length is less
                                                                        than minimum allowed segment length for TCP,
                                                                        UDP, or ICMP.
                                                                        This error is valid when IPv6 or IPv4 header is
                                                                        detected. */
#define HAL_ETH_RX_ERROR_DB              (1UL << 19U)              /*!< Dribble Bit Error.
                                                                        When this error is reported, it indicates that
                                                                        the received packet has a noninteger multiple
                                                                        of bytes (odd nibbles). This bit is valid only
                                                                        in the MII Mode. */
#define HAL_ETH_RX_ERROR_REC             (1UL << 20U)              /*!< Receive Error.
                                                                        When this error is reported, it indicates that
                                                                        the ETH_RX_ER signal is asserted while the
                                                                        ETH_RX_DV signal is asserted during packet
                                                                        reception. This error also includes carrier
                                                                        extension error in the GMII and Half-duplex
                                                                        mode. Error can be of less or no extension, or
                                                                        error (rxd!= 0f) during extension. */
#define HAL_ETH_RX_ERROR_OFL             (1UL << 21U)              /*!< Overflow Error.
                                                                        When this error is reported, it indicates that
                                                                        the received packet is damaged because of
                                                                        buffer overflow in Rx FIFO.
                                                                        This error is reported only when the DMA
                                                                        transfers a partial packet to the application.
                                                                        */
#define HAL_ETH_RX_ERROR_RWT             (1UL << 22U)              /*!< Receive Watchdog Timeout.
                                                                        When this error is reported, it indicates that
                                                                        the Receive Watchdog Timer has expired while
                                                                        receiving the current packet. The current
                                                                        packet is truncated after watchdog timeout. */
#define HAL_ETH_RX_ERROR_GP              (1UL << 23U)              /*!< Giant Packet.
                                                                        When this error is reported, it indicates that
                                                                        the packet length exceeds the specified maximum
                                                                        Ethernet size of 1518, 1522, or 2000 bytes
                                                                        (9018 or 9022 bytes if jumbo packet enable is
                                                                        set).
                                                                        Giant packet indicates only the packet length.
                                                                        It does not cause any packet truncation. */
#define HAL_ETH_RX_ERROR_CRC             (1UL << 24U)              /*!< CRC Error.
                                                                        When this error is reported, it indicates that
                                                                        a Cyclic Redundancy Check (CRC) error occurred
                                                                        on the received packet. */
/**
  * @}
  */

/** @defgroup ETH_Channel_Tx_Errors ETH Tx channel errors
  * @brief Errors for the Ethernet (ETH) Tx channel.
  *
  * These constants define the possible errors returned by the Ethernet
  * (ETH) channel HAL layer. They are typically used as bitmasks, allowing
  * multiple errors conditions to be reported simultaneously.
  *
  * @note These errors are reported through registered @p p_tx_complete_cb to the user.
  * @{
  */
#define HAL_ETH_TX_ERROR_IH              (1UL <<  0U)              /*!< IP Header Error.
                                                                        This error indicates that the Checksum
                                                                        Offload engine detected an IP header error. If
                                                                        COE detects an IP header error, it still
                                                                        inserts an IPv4 header checksum if the Ethernet
                                                                        Type field indicates an IPv4 payload.
                                                                        In Full-duplex mode, when EST/Qbv is enabled
                                                                        and this bit is set, it indicates the frame
                                                                        drop status due to Frame Size error or Schedule
                                                                        Error. */
#define HAL_ETH_TX_ERROR_DB              (1UL <<  1U)              /*!< Deferred Bit.
                                                                        This error indicates that the MAC deferred
                                                                        before transmitting because of presence of
                                                                        carrier. */
#define HAL_ETH_TX_ERROR_UF              (1UL <<  2U)              /*!< Underflow Error.
                                                                        This error indicates that the MAC aborted the
                                                                        packet because the data arrived late from the
                                                                        system memory. */
#define HAL_ETH_TX_ERROR_ED              (1UL <<  3U)              /*!< Excessive Deferral.
                                                                        This error indicates that the transmission
                                                                        ended because of excessive deferral of over
                                                                        24,288 bit times (155,680 bits times in
                                                                        1000-Mbps mode or Jumbo Packet enabled mode).
                                                                        */
#define HAL_ETH_TX_ERROR_EC              (1UL <<  8U)              /*!< Excessive Collision.
                                                                        This error indicates that the transmission was
                                                                        aborted after 16 successive collisions while
                                                                        attempting to transmit the current packet. */
#define HAL_ETH_TX_ERROR_LC              (1UL <<  9U)              /*!< Late Collision.
                                                                        This error indicates that packet transmission
                                                                        was aborted because a collision occurred after
                                                                        the collision window (64 byte times including
                                                                        Preamble in MII mode and 512 byte times
                                                                        including Preamble and Carrier Extension in
                                                                        GMII mode). */
#define HAL_ETH_TX_ERROR_NC              (1UL << 10U)              /*!< No Carrier.
                                                                        This error indicates that the carrier sense
                                                                        signal form the PHY was not asserted during
                                                                        transmission. */
#define HAL_ETH_TX_ERROR_LOC             (1UL << 11U)              /*!< Loss of Carrier.
                                                                        This error indicates that Loss of Carrier
                                                                        occurred during packet transmission. */
#define HAL_ETH_TX_ERROR_PC              (1UL << 12U)              /*!< Payload Checksum Error.
                                                                        This error indicates that the Checksum Offload
                                                                        engine had a failure and did not insert any
                                                                        checksum into the encapsulated TCP, UDP, or
                                                                        ICMP payload. */
#define HAL_ETH_TX_ERROR_JT              (1UL << 14U)              /*!< Jabber Timeout.
                                                                        This error indicates that the MAC transmitter
                                                                        has experienced a jabber timeout. */
#define HAL_ETH_TX_ERROR_DE              (1UL << 23U)              /*!< Descriptor Error.
                                                                        This error indicates that the descriptor
                                                                        content is incorrect. */
/**
  * @}
  */

/** @defgroup ETH_Channel_Rx_Status ETH Rx channel status
  * @brief Status for the Ethernet (ETH) Rx channel.
  *
  * These constants define the possible status returned by the Ethernet
  * (ETH) channel HAL layer. They are typically used as bitmasks, allowing
  * multiple status conditions to be reported simultaneously.
  *
  * @note These status are reported through registered @p p_rx_complete_cb to the user.
  * @{
  */
#define HAL_ETH_RX_STATUS_IPV4           (1UL <<  4U)              /*!< IPv4 header Present.
                                                                      This status indicates that an IPV4 header is
                                                                      detected. */
#define HAL_ETH_RX_STATUS_IPV6           (1UL <<  5U)              /*!< IPv6 header Present.
                                                                      This status indicates that an IPV6 header is
                                                                      detected. */
#define HAL_ETH_RX_STATUS_IPCB           (1UL <<  6U)              /*!< IP Checksum Bypassed.
                                                                      This status indicates that the checksum offload
                                                                      engine is bypassed. */
#define HAL_ETH_RX_STATUS_ARPNR          (1UL << 10U)              /*!< ARP Reply Not Generated.
                                                                      This status indicates that the MAC did not
                                                                      generate the ARP Reply for received ARP Request
                                                                      packet. This error is reported when the MAC is
                                                                      busy transmitting ARP reply to earlier ARP
                                                                      request (only one ARP request is processed at
                                                                      a time). */
#define HAL_ETH_RX_STATUS_TSA            (1UL << 14U)              /*!< Timestamp Available.
                                                                      This status indicates that the Timestamp value is
                                                                      available for the received packet.
                                                                      This is valid only when the last received frame
                                                                      of the packet is completed. */
#define HAL_ETH_RX_STATUS_TD             (1UL << 15U)              /*!< Timestamp Dropped.
                                                                      This status indicates that the timestamp was
                                                                      captured for this packet but got dropped in the
                                                                      MTL Rx FIFO because of overflow. */
#define HAL_ETH_RX_STATUS_VLAN           (1UL << 25U)              /*!< Outer (and Inner) VLAG Tag Present.
                                                                      This status indicates that an Outer VLAG tag is
                                                                      detected. If Double VLAN tag processing and VLAN
                                                                      tag stripping are enabled the Inner VLAN tag is
                                                                      detected too. */
#define HAL_ETH_RX_STATUS_LD             (1UL << 28U)              /*!< Last Descriptor.
                                                                      This status indicates indicates that the buffers
                                                                      to which this descriptor is pointing are the last
                                                                      segment of the packet. */
#define HAL_ETH_RX_STATUS_FD             (1UL << 29U)              /*!< First Descriptor.
                                                                      This status indicates that this descriptor
                                                                      contains the first segment of the packet. */
#define HAL_ETH_RX_STATUS_INVALID        (1UL << 31U)              /*!< Rx Buffer Status.
                                                                      This status status indicates that the buffer
                                                                      which this descriptor is pointing is dirty (no
                                                                      data were received). */
/**
  * @}
  */

/** @defgroup ETH_Channel_Tx_Status ETH Tx channel status
  * @brief Status for the Ethernet (ETH) Tx channel.
  *
  * These constants define the possible status returned by the Ethernet
  * (ETH) channel HAL layer. They are typically used as bitmasks, allowing
  * multiple status conditions to be reported simultaneously.
  *
  * @note These status are reported through registered @p p_tx_complete_cb to the user.
  * @{
  */
#define HAL_ETH_TX_STATUS_TTSS           (1UL << 17U)              /*!< Tx Timestamp Status.
                                                                      This status indicates that a timestamp has been
                                                                      captured for the corresponding transmit packet.
                                                                      */
#define HAL_ETH_TX_STATUS_LD             (1UL << 28U)              /*!< Last Descriptor.
                                                                      This status indicates indicates that the buffers
                                                                      to which this descriptor is pointing are the last
                                                                      segment of the packet. */
#define HAL_ETH_TX_STATUS_FD             (1UL << 29U)              /*!< First Descriptor.
                                                                      This status indicates that this descriptor
                                                                      contains the first segment of the packet. */
#define HAL_ETH_TX_STATUS_INVALID        (1UL << 31U)              /*!< Tx Buffer Status.
                                                                      This status indicates that the buffer which this
                                                                      descriptor is pointing is dirty (not yet
                                                                      transmitted). */
/**
  * @}
  */

/** @defgroup ETH_Tx_Packet_Control_Attributes Ethernet Tx Packet Control Attributes
  * @brief Constants to configure controls for Ethernet transmit (Tx) packets.
  * @{
  */
/**
  * @def HAL_ETH_TX_PKT_CTRL_CSUM
  * @brief Enable IP header checksum calculation and insertion.
  *
  * When this control is enabled, the hardware will automatically calculate and insert
  * the IP header checksum for the outgoing packet.
  */
#define HAL_ETH_TX_PKT_CTRL_CSUM         0x00000001UL

/**
  * @def HAL_ETH_TX_PKT_CTRL_SAIC
  * @brief Enable MAC Source Address (SA) Insertion Control.
  *
  * When this control is enabled, the hardware will insert or replace the source MAC address
  * in the outgoing packet as per the configuration.
  */
#define HAL_ETH_TX_PKT_CTRL_SAIC         0x00000002UL

/**
  * @def HAL_ETH_TX_PKT_CTRL_VLANTAG
  * @brief Enable VLAN Tag Insertion or Replacement.
  *
  * When this control is enabled, the hardware will insert or replace the VLAN tag in the
  * outgoing packet according to the specified VLAN configuration.
  */
#define HAL_ETH_TX_PKT_CTRL_VLANTAG      0x00000004UL

/**
  * @def HAL_ETH_TX_PKT_CTRL_INNERVLANTAG
  * @brief Enable Inner VLAN Tag Insertion or Replacement.
  *
  * When this control is enabled, the hardware will insert or replace the inner VLAN tag
  * (for double-tagged or Q-in-Q packets) in the outgoing packet.
  */
#define HAL_ETH_TX_PKT_CTRL_INNERVLANTAG 0x00000008UL

/**
  * @def HAL_ETH_TX_PKT_CTRL_CRCPAD
  * @brief Enable MAC CRC and Padding Insertion.
  *
  * When this control is enabled, the hardware will automatically append the CRC and
  * perform padding to meet the minimum Ethernet frame size requirements.
  */
#define HAL_ETH_TX_PKT_CTRL_CRCPAD       0x00000020UL
/**
  * @}
  */

/** @defgroup ETH_Bus_Burst_Length ETH system bus burst length
  * @{
  */
#define HAL_ETH_BUS_BURST_LEN_4_BEAT     ETH_DMASBMR_BLEN4         /*!< System Bus Burst Length 4 beats   */
#define HAL_ETH_BUS_BURST_LEN_8_BEAT     ETH_DMASBMR_BLEN8         /*!< System Bus Burst Length 8 beats   */
#define HAL_ETH_BUS_BURST_LEN_16_BEAT    ETH_DMASBMR_BLEN16        /*!< System Bus Burst Length 16 beats  */
#define HAL_ETH_BUS_BURST_LEN_32_BEAT    ETH_DMASBMR_BLEN32        /*!< System Bus Burst Length 32 beats  */
#define HAL_ETH_BUS_BURST_LEN_64_BEAT    ETH_DMASBMR_BLEN64        /*!< System Bus Burst Length 64 beats  */
#define HAL_ETH_BUS_BURST_LEN_128_BEAT   ETH_DMASBMR_BLEN128       /*!< System Bus Burst Length 128 beats */
#define HAL_ETH_BUS_BURST_LEN_256_BEAT   ETH_DMASBMR_BLEN256       /*!< System Bus Burst Length 256 beats */

/**
  * @}
  */

/**************************************** PMT Control and Status definitions *****************************************/
/** @defgroup ETH_PMT_Triggers ETH PMT control flags
  * @brief Constants for configuring Power Management Timer (PMT) control flags for Ethernet.
  * @{
  */
/**
  * @def HAL_ETH_PMT_CTRL_FWD_WAKEUP_PKT
  * @brief Enable Remote Wake-up Packet Forwarding.
  *
  * When this control is set, the Ethernet controller will forward remote wake-up packets
  * to the host system.
  *
  * @see HAL_ETH_EnterPowerDownMode
  */
#define HAL_ETH_PMT_CTRL_FWD_WAKEUP_PKT  ETH_MACPCSR_RWKPFE

/**
  * @def HAL_ETH_PMT_CTRL_TRIG_MAGIC_PKT
  * @brief Enable Magic Packet detection in power down mode.
  *
  * When this control is set, the Ethernet controller will detect Magic Packets
  * and trigger a wake-up event while in power down mode.
  *
  * @see HAL_ETH_EnterPowerDownMode
  */
#define HAL_ETH_PMT_CTRL_TRIG_MAGIC_PKT  ETH_MACPCSR_MGKPKTEN

