MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_eth.h
/**
  * @def HAL_ETH_PMT_CTRL_TRIG_RWKUP_PKT
  * @brief Enable Wake Up Packet detection in power down mode.
  *
  * When this control is set, the Ethernet controller will detect remote wake-up packets
  * and trigger a wake-up event while in power down mode.
  *
  * @see HAL_ETH_EnterPowerDownMode
  */
#define HAL_ETH_PMT_CTRL_TRIG_RWKUP_PKT  ETH_MACPCSR_RWKPKTEN

/**
  * @def HAL_ETH_PMT_CTRL_TRIG_GLBL_UCAST
  * @brief Enable Global Unicast packet detection in power down mode.
  *
  * When this control is set, the Ethernet controller will detect global unicast packets
  * and trigger a wake-up event while in power down mode.
  *
  * @see HAL_ETH_EnterPowerDownMode
  */
#define HAL_ETH_PMT_CTRL_TRIG_GLBL_UCAST ETH_MACPCSR_GLBLUCAST

/**
  * @def HAL_ETH_PMT_CTRL_TRIG_ALL
  * @brief Enable detection of Magic, Remote, and Global Unicast wake-up packets in power down mode.
  *
  * This control enables simultaneous detection of Magic Packets, remote wake-up packets,
  * and global unicast packets for wake-up events while in power down mode.
  *
  * @see HAL_ETH_EnterPowerDownMode
  */
#define HAL_ETH_PMT_CTRL_TRIG_ALL        (ETH_MACPCSR_RWKPFE | ETH_MACPCSR_MGKPKTEN | \
                                          ETH_MACPCSR_RWKPKTEN | ETH_MACPCSR_GLBLUCAST)
/**
  * @}
  */

/**************************************** LPI Control and Status definitions *****************************************/
/** @defgroup ETH_LPI_Controls ETH LPI controls
  * @brief Constants for configuring Low Power Idle (LPI) controls for Ethernet.
  * @{
  */
/**
  * @def HAL_ETH_LPI_CTRL_TX_CLK_STOP_ENABLE
  * @brief Enable Tx Clock Stop in LPI mode.
  *
  * When this control is set, the Tx clock can be stopped after entering Tx LPI (Low Power Idle) mode.
  * If the RGMII interface is selected, the Tx clock is still required for transmitting the LPI pattern.
  *
  * @see HAL_ETH_EnterLPIMode
  */
#define HAL_ETH_LPI_CTRL_TX_CLK_STOP_ENABLE                  ETH_MACLCSR_LPITCSE

/**
  * @def HAL_ETH_LPI_CTRL_TX_AUTOMATE_ENABLE
  * @brief Enable Tx LPI Automate.
  *
  * When this control is set, the MAC will enter LPI mode only after all outstanding packets
  * (in the core) and pending packets (in the application interface) have been transmitted.
  *
  * @see HAL_ETH_EnterLPIMode
  */
#define HAL_ETH_LPI_CTRL_TX_AUTOMATE_ENABLE                  ETH_MACLCSR_LPITXA
/**
  * @}
  */

/**************************************** MDIO Command Attributes definitions ****************************************/
/** @defgroup ETH_MDIO_Command_Attributes ETH MDIO command attributes
  * @brief Constants for configuring MDIO (Management Data Input/Output) command attributes for Ethernet.
  * @{
  */

/**
  * @def HAL_ETH_MDIO_FEAT_PSE
  * @brief Enable MDIO preamble suppression feature.
  *
  * Selects the preamble length for the MDIO frame.
  * - Feature disabled: 32-bit preamble (standard, recommended for compatibility)
  * - Feature enabled : 1-bit preamble (suppressed, for PHYs that support preamble suppression)
  *
  * @see HAL_ETH_MDIO_SetOpAttributes
  */
#define HAL_ETH_MDIO_FEAT_PSE                                ETH_MACMDIOAR_PSE

/**
  * @def HAL_ETH_MDIO_FEAT_BTB
  * @brief Enable MDIO back-to-back operation mode.
  *
  * Controls whether MDIO operations are performed in back-to-back mode.
  * - Feature disabled: Normal operation (default)
  * - Feature enabled : Back-to-back operation (for consecutive MDIO transactions)
  *
  * @see HAL_ETH_MDIO_SetOpAttributes
  */
#define HAL_ETH_MDIO_FEAT_BTB                                ETH_MACMDIOAR_BTB

/**
  * @def HAL_ETH_MDIO_NTC_1_CYCLE
  * @brief Trim MDIO clock by 1 cycle.
  *
  * Sets the MDIO clock trimming to 1 cycle.
  *
  * @see HAL_ETH_MDIO_SetOpAttributes
  */
#define HAL_ETH_MDIO_NTC_1_CYCLE                             (1UL << ETH_MACMDIOAR_NTC_Pos)

/**
  * @def HAL_ETH_MDIO_NTC_2_CYCLES
  * @brief Trim MDIO clock by 2 cycles.
  *
  * Sets the MDIO clock trimming to 2 cycles.
  *
  * @see HAL_ETH_MDIO_SetOpAttributes
  */
#define HAL_ETH_MDIO_NTC_2_CYCLES                            (2UL << ETH_MACMDIOAR_NTC_Pos)

/**
  * @def HAL_ETH_MDIO_NTC_3_CYCLES
  * @brief Trim MDIO clock by 3 cycles.
  *
  * Sets the MDIO clock trimming to 3 cycles.
  *
  * @see HAL_ETH_MDIO_SetOpAttributes
  */
#define HAL_ETH_MDIO_NTC_3_CYCLES                            (3UL << ETH_MACMDIOAR_NTC_Pos)

/**
  * @def HAL_ETH_MDIO_NTC_4_CYCLES
  * @brief Trim MDIO clock by 4 cycles.
  *
  * Sets the MDIO clock trimming to 4 cycles.
  *
  * @see HAL_ETH_MDIO_SetOpAttributes
  */
#define HAL_ETH_MDIO_NTC_4_CYCLES                            (4UL << ETH_MACMDIOAR_NTC_Pos)

/**
  * @def HAL_ETH_MDIO_NTC_5_CYCLES
  * @brief Trim MDIO clock by 5 cycles.
  *
  * Sets the MDIO clock trimming to 5 cycles.
  *
  * @see HAL_ETH_MDIO_SetOpAttributes
  */
#define HAL_ETH_MDIO_NTC_5_CYCLES                            (5UL << ETH_MACMDIOAR_NTC_Pos)

/**
  * @def HAL_ETH_MDIO_NTC_6_CYCLES
  * @brief Trim MDIO clock by 6 cycles.
  *
  * Sets the MDIO clock trimming to 6 cycles.
  *
  * @see HAL_ETH_MDIO_SetOpAttributes
  */
#define HAL_ETH_MDIO_NTC_6_CYCLES                            (6UL << ETH_MACMDIOAR_NTC_Pos)

/**
  * @def HAL_ETH_MDIO_NTC_7_CYCLES
  * @brief Trim MDIO clock by 7 cycles.
  *
  * Sets the MDIO clock trimming to 7 cycles.
  *
  * @see HAL_ETH_MDIO_SetOpAttributes
  */
#define HAL_ETH_MDIO_NTC_7_CYCLES                            (7UL << ETH_MACMDIOAR_NTC_Pos)
/**
  * @}
  */

/**************************************** Remote Wakeup Command List definitions *************************************/
/** @defgroup ETH_RWK_Packet_Filters_Number ETH remote wake-up filter number
  * @brief Constants defining the number of remote wake-up (RWK) packet filters supported by the Ethernet hardware.
  * @{
  */
/**
  * @def HAL_ETH_RWK_FILT_PER_BLOCK
  * @brief Number of remote wake-up (RWK) packet filters per filter block.
  *
  * This constant specifies the maximum number of RWK packet filters that can be configured
  * within a single filter block. Each filter can be programmed to match specific packet patterns
  * for remote wake-up functionality.
  *
  * @see hal_eth_rwk_filter_block_t
  */
#define HAL_ETH_RWK_FILT_PER_BLOCK                           ETH_NB_OF_RWK_FILT_PER_BLOCK

/**
  * @def HAL_ETH_RWK_FILT_BLOCK_NUM
  * @brief Number of available RWK filter blocks.
  *
  * This constant defines the total number of filter blocks supported by the hardware for
  * remote wake-up packet filtering. The total number of RWK filters is the product of
  * @ref HAL_ETH_RWK_FILT_PER_BLOCK and this value.
  *
  * @see hal_eth_rwk_filter_lut_t
  * @see HAL_ETH_SetRemoteWakeUpPcktFilter
  */
#define HAL_ETH_RWK_FILT_BLOCK_NUM                           ETH_NB_OF_RWK_FILT_BLOCKS
/**
  * @}
  */

/** @defgroup ETH_RWK_Filter_Commands ETH remote wake-up command list
  * @brief Constants for configuring the 4-bit filter command for remote wakeup filters.
  * @{
  */
/**
  * @def HAL_ETH_RWK_FLT_CMD_ENABLE
  * @brief Enable filter i.
  *
  * Bit 0: When set, enables filter i.
  * If this bit is not set, filter i is disabled and will not participate in remote wakeup packet matching.
  *
  * @see hal_eth_rwk_pkt_filter_t
  * @see HAL_ETH_SetRemoteWakeUpPcktFilter
  */
#define HAL_ETH_RWK_FLT_CMD_ENABLE                           (1UL << 0U)

/**
  * @def HAL_ETH_RWK_FLT_CMD_AND_PREVIOUS
  * @brief AND logic with previous filter.
  *
  * Bit 1: When set, the result of the current filter is logically ANDed with the result of the previous filter.
  * This allows for filter patterns longer than 32 bytes by splitting the mask among multiple filters.
  * Multiple filters can be chained using this bit to create complex matching logic.
  *
  * @see hal_eth_rwk_pkt_filter_t
  * @see HAL_ETH_SetRemoteWakeUpPcktFilter
  */
#define HAL_ETH_RWK_FLT_CMD_AND_PREVIOUS                     (1UL << 1U)

/**
  * @def HAL_ETH_RWK_FLT_CMD_INVERSE_MODE
  * @brief Inverse mode for CRC16 hash function.
  *
  * Bit 2: When set, reverses the logic of the CRC16 hash function signal, causing the filter to reject packets
  * with a matching CRC16 value.
  * This bit, in combination with @ref HAL_ETH_RWK_FLT_CMD_AND_PREVIOUS, allows the creation of filter logic such as
  * "Pattern 1 AND NOT Pattern 2" to reject a subset of remote wakeup packets.
  *
  * @see hal_eth_rwk_pkt_filter_t
  * @see HAL_ETH_SetRemoteWakeUpPcktFilter
  */
#define HAL_ETH_RWK_FLT_CMD_INVERSE_MODE                     (1UL << 2U)

/**
  * @def HAL_ETH_RWK_FLT_CMD_MULTICAST
  * @brief Multicast address type selection.
  *
  * Bit 3: Specifies the address type for the pattern.
  * - When set, the pattern applies only to multicast packets.
  * - When reset, the pattern applies only to unicast packets.
  *
  * @see hal_eth_rwk_pkt_filter_t
  * @see HAL_ETH_SetRemoteWakeUpPcktFilter
  */
#define HAL_ETH_RWK_FLT_CMD_MULTICAST                        (1UL << 3U)
/**
  * @}
  */
/**
  * @}
  */

/* Exported types ------------------------------------------------------------*/
/** @defgroup ETH_Exported_Types HAL ETH types
  * @{
  */
/** @defgroup ETH_Exported_Types_Group1 Enumerations
  * @{
  */
/**************************************  ETH Peripheral Handle Enumerations  *****************************************/
/**
  * @brief HAL ETH instances enumeration definition
  *
  */
typedef enum
{
  HAL_ETH1  = ETH1_BASE        /*!< Instance ETH */
} hal_eth_t;

