MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_eth.h
/********************************  ETH Peripheral and Channel State Enumerations  ************************************/
/**
  * @brief HAL ETH state enumeration definition
  */
typedef enum
{
  HAL_ETH_STATE_RESET               = 0UL,                 /*!< ETH Peripheral is not yet Initialized or De-Initialized
                                                                */
  HAL_ETH_STATE_INIT                = (1UL << 31U),        /*!< ETH Peripheral is initialized but not yet configured
                                                                */
  HAL_ETH_STATE_CONFIGURED          = (1UL << 30U),        /*!< ETH Peripheral initialized and a global config applied
                                                                */
  HAL_ETH_STATE_POWER_DOWN          = (1UL << 28U),        /*!< ETH peripheral is in power down mode
                                                                */
  HAL_ETH_STATE_FAULT               = (1UL << 27U)         /*!< ETH Peripheral encountered an unrecoverable error and
                                                                a recovery sequence is needed */
} hal_eth_state_t;

/**
  * @brief  HAL ETH channel state structures definition
  */
typedef enum
{
  HAL_ETH_CHANNEL_STATE_RESET       = (1UL << 0U),         /*!< Channel is disabled (Reset state) */
  HAL_ETH_CHANNEL_STATE_CONFIGURED  = (1UL << 31U),        /*!< Channel is configured and stopped */
  HAL_ETH_CHANNEL_STATE_ACTIVE      = (1UL << 30U),        /*!< Channel is started and running (Active state) */
  HAL_ETH_CHANNEL_STATE_SUSPENDED   = (1UL << 29U)         /*!< Channel is started and suspended (Idle state) */
} hal_eth_channel_state_t;

/***********************************  ETH request FIFO event enumerations  ****************************************/
/**
  * @brief  ETH FIFO event mode type enum definition
  */
typedef enum
{
  HAL_ETH_FIFO_EVENT_NONE           = 0x00000001UL,        /*!< ETH Interrupt is disabled - Polling mode, no interrupt
                                                                */
  HAL_ETH_FIFO_EVENT_ALWAYS         = 0x00000002UL,        /*!< ETH FIFO event on every executed descriptor */
  HAL_ETH_FIFO_EVENT_CYCLIC         = 0x00000004UL         /*!< ETH Interrupt after every N descriptors.
                                                                This mode reduces interrupt load for high-throughput
                                                                 operation. */
} hal_eth_fifo_event_mode_t;

/************************************  ETH Peripheral Configuration Enumerations  ************************************/
/**
  * @brief  HAL ETH Media Interfaces enum definition
  */
typedef enum
{
  HAL_ETH_MEDIA_IF_MII              = 0x00UL,              /*!< Media Independent Interface               */
  HAL_ETH_MEDIA_IF_RMII             = 0x02UL,              /*!< Reduced Media Independent Interface       */
} hal_eth_media_interface_t;

/************************************  ETH Transmit Packet Controls Enumerations  ************************************/
/**
  * @brief HAL ETH Tx Packet Source Address Controls
  */
typedef enum
{
  HAL_ETH_TX_PKT_SRC_ADDR_CONTROL_DISABLE = 0x00000000UL,   /*!< SA Insertion Control: Do not include the source
                                                                 address. */
  HAL_ETH_TX_PKT_SRC_ADDR_INSERT    = 0x00800000UL,         /*!< SA Insertion Control: Include or insert the source
                                                                address. */
  HAL_ETH_TX_PKT_SRC_ADDR_REPLACE   = 0x01000000UL          /*!< SA Insertion Control: Replace the source address */
} hal_eth_tx_pkt_src_addr_ctrl_t;

/**
  * @brief HAL ETH Tx Packet CRC Pad Controls
  */
typedef enum
{
  HAL_ETH_TX_PKT_CRC_PAD_DISABLE    = 0x08000000UL,        /*!< CRC Pad Control: Disable CRC Insertion */
  HAL_ETH_TX_PKT_CRC_PAD_INSERT     = 0x00000000UL,        /*!< CRC Pad Control: CRC and Pad Insertion */
  HAL_ETH_TX_PKT_CRC_INSERT         = 0x04000000UL,        /*!< CRC Pad Control: CRC Insertion (Disable Pad Insertion)
                                                                */
  HAL_ETH_TX_PKT_CRC_REPLACE        = 0x0C000000UL         /*!< CRC Pad Control: CRC Replacement */
} hal_eth_tx_pkt_crc_pad_ctrl_t;

/**
  * @brief HAL ETH Tx Packet Checksum Controls
  */
typedef enum
{
  HAL_ETH_TX_PKT_CSUM_DISABLE               = 0x00000000UL, /*!< Do Nothing: Checksum Engine is disabled */
  HAL_ETH_TX_PKT_CSUM_HEADER_INSERT         = 0x00010000UL, /*!< Only IP header checksum calculation and insertion are
                                                                enabled. */
  HAL_ETH_TX_PKT_CSUM_PAYLOAD_INSERT        = 0x00020000UL, /*!< IP header checksum and payload checksum calculation
                                                                and insertion are
                                                                enabled, but pseudo header checksum is not calculated
                                                                in hardware */
  HAL_ETH_TX_PKT_CSUM_PAYLOAD_HEADER_INSERT = 0x00030000UL  /*!< IP Header checksum and payload checksum calculation and
                                                                insertion are enabled, and pseudo header checksum is
                                                                calculated in hardware. */
} hal_eth_tx_pkt_csum_ctrl_t;

/**
  * @brief HAL ETH Tx Packet VLAN Controls
  */
typedef enum
{
  HAL_ETH_TX_PKT_VLAN_DISABLE       = 0x00000000UL,        /*!< Do not add a VLAN tag. */
  HAL_ETH_TX_PKT_VLAN_REMOVE        = 0x00004000UL,        /*!< Remove the VLAN tag from the packets before
                                                                transmission. */
  HAL_ETH_TX_PKT_VLAN_INSERT        = 0x00008000UL,        /*!< Insert a VLAN tag. */
  HAL_ETH_TX_PKT_VLAN_REPLACE       = 0x0000C000UL         /*!< Replace the VLAN tag. */
} hal_eth_tx_pkt_vlan_ctrl_t;

/**
  * @brief HAL ETH Tx Packet Inner VLAN Controls
  */
typedef enum
{
  HAL_ETH_TX_PKT_INNER_VLAN_DISABLE = 0x00000000UL,        /*!< Do not add the inner VLAN tag. */
  HAL_ETH_TX_PKT_INNER_VLAN_REMOVE  = 0x00040000UL,        /*!< Remove the inner VLAN tag from the packets before
                                                                transmission. */
  HAL_ETH_TX_PKT_INNER_VLAN_INSERT  = 0x00080000UL,        /*!< Insert the inner VLAN tag. */
  HAL_ETH_TX_PKT_INNER_VLAN_REPLACE = 0x000C0000UL         /*!< Replace the inner VLAN tag. */
} hal_eth_tx_pkt_inner_vlan_ctrl_t;

/**
  * @brief HAL ETH Tx Packet Notification Controls
  */
typedef enum
{
  HAL_ETH_TX_PKT_NOTIFY_DISABLE     = 0UL,                 /*!< Do not notify application when the packet transmit
                                                                request is completed */
  HAL_ETH_TX_PKT_NOTIFY_ENABLE      = 1UL                  /*!< Notify application when the packet transmit request is
                                                                completed  */
} hal_eth_tx_pkt_notify_ctrl_t;

/**************************************  ETH MAC Configuration Enumerations  *****************************************/
/**
  * @brief HAL ETH Speed
  */
typedef enum
{
  HAL_ETH_MAC_SPEED_10M             = 0x00000000UL,       /*!< ETH MAC Speed 10M   */
  HAL_ETH_MAC_SPEED_100M            = ETH_MACCR_FES,      /*!< ETH MAC Speed 100M  */
} hal_eth_mac_speed_t;

/**
  * @brief HAL ETH Duplex Mode
  */
typedef enum
{
  HAL_ETH_MAC_FULL_DUPLEX_MODE      = ETH_MACCR_DM,        /*!< ETH MAC Full Duplex Mode */
  HAL_ETH_MAC_HALF_DUPLEX_MODE      = 0x00000000UL         /*!< ETH MAC Half Duplex Mode */
} hal_eth_mac_duplex_mode_t;

/**
  * @brief  HAL ETH Loopback mode Control enumeration definition
  */
typedef enum
{
  HAL_ETH_MAC_LOOPBACK_DISABLE      = 0UL,                 /*!< ETH MAC Loopback mode Disable */
  HAL_ETH_MAC_LOOPBACK_ENABLE       = ETH_MACCR_LM         /*!< ETH MAC Loopback mode Enable  */
} hal_eth_mac_loopback_ctrl_t;

/**
  * @brief HAL ETH Source Address Control (Disable, Insertion or Replacement)
  */
typedef enum
{
  HAL_ETH_MAC_SA_DISABLE        = 0x00000000UL,       /*!< Disable SA insertion or replacement in the transmitted
                                                                packets */
  HAL_ETH_MAC_SA_MAC0_INS       = 0x20000000UL,       /*!< Inserts the content of the MAC Address 0 registers in
                                                                the SA field of all transmitted packets */
  HAL_ETH_MAC_SA_MAC1_INS       = 0x60000000UL,       /*!< Inserts the content of the MAC Address 1 registers in
                                                                the SA field of all transmitted packets */
  HAL_ETH_MAC_SA_MAC0_REP       = 0x30000000UL,      /*!< Replace the content of the MAC Address 0 registers in
                                                                the SA field of all transmitted packets */
  HAL_ETH_MAC_SA_MAC1_REP       = ETH_MACCR_SARC     /*!< Replace the content of the MAC Address 1 registers in
                                                                the SA field of all transmitted packets */
} hal_eth_mac_src_addr_ctrl_t;

/**
  * @brief HAL ETH Inter Packet Gap
  */
typedef enum
{
  HAL_ETH_MAC_INTER_PKT_GAP_96_BIT  = 0x00000000UL,        /*!< ETH MAC Inter Packet Gap 96 Bit  */
  HAL_ETH_MAC_INTER_PKT_GAP_88_BIT  = 0x01000000UL,        /*!< ETH MAC Inter Packet Gap 88 Bit  */
  HAL_ETH_MAC_INTER_PKT_GAP_80_BIT  = 0x02000000UL,        /*!< ETH MAC Inter Packet Gap 80 Bit  */
  HAL_ETH_MAC_INTER_PKT_GAP_72_BIT  = 0x03000000UL,        /*!< ETH MAC Inter Packet Gap 72 Bit  */
  HAL_ETH_MAC_INTER_PKT_GAP_64_BIT  = 0x04000000UL,        /*!< ETH MAC Inter Packet Gap 64 Bit  */
  HAL_ETH_MAC_INTER_PKT_GAP_56_BIT  = 0x05000000UL,        /*!< ETH MAC Inter Packet Gap 56 Bit  */
  HAL_ETH_MAC_INTER_PKT_GAP_48_BIT  = 0x06000000UL,        /*!< ETH MAC Inter Packet Gap 48 Bit  */
  HAL_ETH_MAC_INTER_PKT_GAP_40_BIT  = ETH_MACCR_IPG        /*!< ETH MAC Inter Packet Gap 40 Bit  */
} hal_eth_mac_inter_pkt_gap_t;

/**
  * @brief HAL ETH MAC Back Off Limit
  */
typedef enum
{
  HAL_ETH_MAC_BACK_OFF_LIMIT_10     = 0x00000000UL,        /*!< ETH MAC Back Off Limit 10 */
  HAL_ETH_MAC_BACK_OFF_LIMIT_8      = 0x00000020UL,        /*!< ETH MAC Back Off Limit 8 */
  HAL_ETH_MAC_BACK_OFF_LIMIT_4      = 0x00000040UL,        /*!< ETH MAC Back Off Limit 4 */
  HAL_ETH_MAC_BACK_OFF_LIMIT_1      = ETH_MACCR_BL         /*!< ETH MAC Back Off Limit 1 */
} hal_eth_mac_back_off_limit_t;

/**
  * @brief HAL ETH MAC Preamble Length
  */
typedef enum
{
  HAL_ETH_MAC_PREAMBLE_LENGTH_7     = 0x00000000UL,        /*!< ETH MAC Preamble Length 7 */
  HAL_ETH_MAC_PREAMBLE_LENGTH_5     = 0x00000004UL,        /*!< ETH MAC Preamble Length 5 */
  HAL_ETH_MAC_PREAMBLE_LENGTH_3     = 0x00000008UL         /*!< ETH MAC Preamble Length 3 */
} hal_eth_mac_preeamble_length_t;

/**
  * @brief HAL ETH MAC Watchdog Timeout
  */
typedef enum
{
  HAL_ETH_MAC_RX_WDT_2KB            = 0x00000000UL,        /*!< ETH MAC Watchdog Timeout 2KB  */
  HAL_ETH_MAC_RX_WDT_3KB            = 0x00000001UL,        /*!< ETH MAC Watchdog Timeout 3KB  */
  HAL_ETH_MAC_RX_WDT_4KB            = 0x00000002UL,        /*!< ETH MAC Watchdog Timeout 4KB  */
  HAL_ETH_MAC_RX_WDT_5KB            = 0x00000003UL,        /*!< ETH MAC Watchdog Timeout 5KB  */
  HAL_ETH_MAC_RX_WDT_6KB            = 0x00000004UL,        /*!< ETH MAC Watchdog Timeout 6KB  */
  HAL_ETH_MAC_RX_WDT_7KB            = 0x00000005UL,        /*!< ETH MAC Watchdog Timeout 7KB  */
  HAL_ETH_MAC_RX_WDT_8KB            = 0x00000006UL,        /*!< ETH MAC Watchdog Timeout 8KB  */
  HAL_ETH_MAC_RX_WDT_9KB            = 0x00000007UL,        /*!< ETH MAC Watchdog Timeout 9KB  */
  HAL_ETH_MAC_RX_WDT_10KB           = 0x00000008UL,        /*!< ETH MAC Watchdog Timeout 10KB */
  HAL_ETH_MAC_RX_WDT_11KB           = 0x00000009UL,        /*!< ETH MAC Watchdog Timeout 11KB */
  HAL_ETH_MAC_RX_WDT_12KB           = 0x0000000AUL,        /*!< ETH MAC Watchdog Timeout 12KB */
  HAL_ETH_MAC_RX_WDT_13KB           = 0x0000000BUL,        /*!< ETH MAC Watchdog Timeout 13KB */
  HAL_ETH_MAC_RX_WDT_14KB           = 0x0000000CUL,        /*!< ETH MAC Watchdog Timeout 14KB */
  HAL_ETH_MAC_RX_WDT_15KB           = 0x0000000DUL,        /*!< ETH MAC Watchdog Timeout 15KB */
  HAL_ETH_MAC_RX_WDT_16KB           = 0x0000000EUL         /*!< ETH MAC Watchdog Timeout 16KB */
} hal_eth_mac_rx_wd_timeout_t;

/**
  * @brief  HAL ETH MAC Giant Packet Size Limit Control enumeration definition
  */
typedef enum
{
  HAL_ETH_MAC_GPKT_SZ_LIMIT_DISABLE = 0UL,                 /*!< ETH MAC Giant Packet Size Limit Disable */
  HAL_ETH_MAC_GPKT_SZ_LIMIT_ENABLE  = ETH_MACCR_GPSLCE     /*!< ETH MAC Giant Packet Size Limit Enable  */
} hal_eth_mac_gpkt_sz_limit_ctrl_t;

/**
  * @brief  HAL ETH MAC IEEE 802.3as Support for 2K length Packets Control enumeration definition
  */
typedef enum
{
  HAL_ETH_MAC_2K_PKT_LEN_DISABLE    = 0UL,                 /*!< ETH MAC IEEE 802.3as Support for 2K length Packets
                                                                Disable */
  HAL_ETH_MAC_2K_PKT_LEN_ENABLE     = ETH_MACCR_S2KP       /*!< ETH MAC IEEE 802.3as Support for 2K length Packets
                                                                Enable  */
} hal_eth_mac_2k_pkt_len_ctrl_t;

/**
  * @brief  HAL ETH MAC CRC stripping for Type Packets Control enumeration definition
  */
typedef enum
{
  HAL_ETH_MAC_CRC_STRIP_PKT_DISABLE = 0UL,                 /*!< ETH MAC CRC stripping for Type Packets Disable */
  HAL_ETH_MAC_CRC_STRIP_PKT_ENABLE  = ETH_MACCR_CST        /*!< ETH MAC CRC stripping for Type Packets Enable  */
} hal_eth_mac_crc_strip_pkt_ctrl_t;

/**
  * @brief  HAL ETH MAC Automatic MAC Pad/CRC Stripping Control enumeration definition
  */
typedef enum
{
  HAL_ETH_MAC_AUTO_PAD_CRC_S_DISABLE = 0UL,                /*!< ETH MAC Automatic Pad/CRC Stripping Disable */
  HAL_ETH_MAC_AUTO_PAD_CRC_S_ENABLE  = ETH_MACCR_ACS       /*!< ETH MAC Automatic Pad/CRC Stripping Enable  */
} hal_eth_mac_auto_pad_crc_s_ctrl_t;

/**
  * @brief  HAL ETH MAC Watchdog Timer on Rx Path Control enumeration definition
  */
typedef enum
{
  HAL_ETH_MAC_RX_WD_TIM_DISABLE     = ETH_MACCR_WD,        /*!< ETH MAC Watchdog timer on Rx path Disable */
  HAL_ETH_MAC_RX_WD_TIM_ENABLE      = 0UL                  /*!< ETH MAC Watchdog timer on Rx path Enable  */
} hal_eth_mac_rx_wd_tim_ctrl_t;

/**
  * @brief  HAL ETH MAC Jabber Timer on Tx Path Control enumeration definition
  */
typedef enum
{
  HAL_ETH_MAC_TX_JABBER_TIM_DISABLE = ETH_MACCR_JD,        /*!< ETH MAC Jabber timer on Tx path Disable */
  HAL_ETH_MAC_TX_JABBER_TIM_ENABLE  = 0UL                  /*!< ETH MAC Jabber timer on Tx path Enable  */
} hal_eth_mac_tx_jabber_tim_ctrl_t;

/**
  * @brief  HAL ETH MAC Jumbo Packet on Rx Control enumeration definition
  */
typedef enum
{
  HAL_ETH_MAC_RX_JUMBO_PKT_DISABLE  = 0UL,                 /*!< ETH MAC Jumbo Packet on Rx path Disable */
  HAL_ETH_MAC_RX_JUMBO_PKT_ENABLE   = ETH_MACCR_JE         /*!< ETH MAC Jumbo Packet on Rx path Enable  */
} hal_eth_mac_rx_jumbo_pkt_ctrl_t;

/**
  * @brief  HAL ETH MAC Checksum Packet on Rx path Control enumeration definition
  */
typedef enum
{
  HAL_ETH_MAC_RX_CSUM_PKT_DISABLE   = 0UL,                 /*!< ETH Checksum Packet on Rx path Disable */
  HAL_ETH_MAC_RX_CSUM_PKT_ENABLE    = ETH_MACCR_IPC        /*!< ETH Checksum Packet on Rx path Enable  */
} hal_eth_mac_rx_csum_pkt_ctrl_t;

/**
  * @brief  HAL ETH MAC Receive Own on Rx path Control enumeration definition
  */
typedef enum
{
  HAL_ETH_MAC_RX_RECEIVE_OWN_DISABLE = ETH_MACCR_DO,        /*!< ETH MAC Receive Own on Rx path Disable */
  HAL_ETH_MAC_RX_RECEIVE_OWN_ENABLE  = 0UL                  /*!< ETH MAC Receive Own on Rx path Enable  */
} hal_eth_mac_rx_receive_own_ctrl_t;

/**
  * @brief  HAL ETH MAC Enables or disables the Carrier Sense Before Transmission in Full Duplex mode
  */
typedef enum
{
  HAL_ETH_MAC_CS_BEFORE_TR_DISABLE  = 0UL,                 /*!< ETH MAC Carrier Sense Before Transmission in
                                                                Full-duplex mode Disable */
  HAL_ETH_MAC_CS_BEFORE_TR_ENABLE   = ETH_MACCR_ECRSFD     /*!< ETH MAC Carrier Sense Before Transmission in
                                                                Full-duplex mode Enable  */
} hal_eth_mac_cs_before_tr_ctrl_t;

/**
  * @brief  HAL ETH MAC Enables or disables the Carrier Sense During Transmission in the Half Duplex mode
  */
typedef enum
{
  HAL_ETH_MAC_CS_DURING_TR_DISABLE  = ETH_MACCR_DCRS,      /*!< ETH MAC Disable Carrier Sense During Transmission
                                                                errors. */
  HAL_ETH_MAC_CS_DURING_TR_ENABLE   = 0UL                  /*!< ETH MAC Enable Carrier Sense During Transmission
                                                                errors. */
} hal_eth_mac_cs_during_tr_ctrl_t;

/**
  * @brief  HAL ETH MAC Enables or disables the MAC retry transmission, when a collision occurs in Half Duplex mode
  */
typedef enum
{
  HAL_ETH_MAC_RETRY_TR_DISABLE      = ETH_MACCR_DR,        /*!< ETH MAC Disable Retry Transmission */
  HAL_ETH_MAC_RETRY_TR_ENABLE       = 0UL                  /*!< ETH MAC Enable Retry Transmission  */
} hal_eth_mac_retry_tr_ctrl_t;

/**
  * @brief  HAL ETH MAC Enables or disables the deferral check function in Half Duplex mode
  */
typedef enum
{
  HAL_ETH_MAC_DEFERRAL_CHECK_DISABLE = 0UL,                /*!< ETH MAC Disable Deferral Check  */
  HAL_ETH_MAC_DEFERRAL_CHECK_ENABLE  = ETH_MACCR_DC        /*!< ETH MAC Enable Deferral Check  */
} hal_eth_mac_deferral_check_ctrl_t;

/**
  * @brief  HAL ETH MAC Enable or disables the Detection of Slow Protocol Packets with unicast address
  */
typedef enum
{
  HAL_ETH_MAC_UC_SLOW_PROTO_DISABLE = 0UL,                 /*!< ETH MAC Disable Unicast Slow Protocol Packet Detect */
  HAL_ETH_MAC_UC_SLOW_PROTO_ENABLE  = ETH_MACECR_USP       /*!< ETH MAC Enable Unicast Slow Protocol Packet Detect  */
} hal_eth_mac_uc_slow_proto_ctrl_t;

/**
  * @brief  HAL ETH MAC Enable or disables the Slow Protocol Detection
  */
typedef enum
{
  HAL_ETH_MAC_SLOW_PROTO_DISABLE    = 0UL,                 /*!< ETH MAC Disable Slow Protocol Detection  */
  HAL_ETH_MAC_SLOW_PROTO_ENABLE     = ETH_MACECR_SPEN      /*!< ETH MAC Enable Slow Protocol Detection   */
} hal_eth_mac_slow_proto_ctrl_t;

/**
  * @brief  HAL ETH MAC Enable or disables the CRC Checking for Received Packets
  */
typedef enum
{
  HAL_ETH_MAC_RX_CRC_PKT_CHK_DISABLE = ETH_MACECR_DCRCC,   /*!< ETH MAC Disable CRC Checking for Received Packets */
  HAL_ETH_MAC_RX_CRC_PKT_CHK_ENABLE  = 0UL                 /*!< ETH MAC Enable CRC Checking for Received Packets  */
} hal_eth_mac_rx_crc_pkt_chk_ctrl_t;

/**
  * @brief  HAL ETH MAC Enable or disables the extended inter packet gap
  */
typedef enum
{
  HAL_ETH_MAC_E_INTER_PKT_GAP_DISABLE = 0UL,               /*!< ETH MAC Disable Extended Inter-Packet Gap */
  HAL_ETH_MAC_E_INTER_PKT_GAP_ENABLE  = ETH_MACECR_EIPGEN  /*!< ETH MAC Enable Extended Inter-Packet Gap  */
} hal_eth_mac_ex_int_pkt_gap_ctrl_t;

/**
  * @brief  HAL ETH MAC Enable or disables the Programmable Watchdog
  */
typedef enum
{
  HAL_ETH_MAC_PROG_WD_DISABLE       = 0UL,                 /*!< ETH MAC Disable Programmable Watchdog */
  HAL_ETH_MAC_PROG_WD_ENABLE        = ETH_MACWJBTR_PWE     /*!< ETH MAC Enable Programmable Watchdog  */
} hal_eth_mac_prog_wd_ctrl_t;

/**
  * @brief  HAL ETH MAC Enable or disables the automatic generation of Zero Quanta Pause Control packets
  */
typedef enum
{
  HAL_ETH_MAC_ZERO_Q_PAUSE_DISABLE  = ETH_MACQTXFCR_DZPQ, /*!< ETH MAC Disable Zero-Quanta Pause */
  HAL_ETH_MAC_ZERO_Q_PAUSE_ENABLE   = 0UL                  /*!< ETH MAC Enable Zero-Quanta Pause  */
} hal_eth_mac_zero_q_pause_ctrl_t;

/**
  * @brief  HAL ETH MAC Enables or disables the MAC to transmit Pause packets in Full Duplex mode or the MAC back
    pressure operation in Half Duplex mode
  */
typedef enum
{
  HAL_ETH_MAC_TR_FLOW_CTRL_DISABLE  = 0UL,                 /*!< ETH MAC Disable Transmit Flow Control */
  HAL_ETH_MAC_TR_FLOW_CTRL_ENABLE   = ETH_MACQTXFCR_TFE   /*!< ETH MAC Enable Transmit Flow Control  */
} hal_eth_mac_tr_flow_ctrl_t;

/**
  * @brief  HAL ETH MAC Enables or disables the MAC to detect Pause packets with unicast address of the station
  */
typedef enum
{
  HAL_ETH_MAC_UC_PAUSE_PKT_DISABLE  = 0UL,                 /*!< ETH MAC Disable Unicast Pause Packet Detect */
  HAL_ETH_MAC_UC_PAUSE_PKT_ENABLE   = ETH_MACRXFCR_UP      /*!< ETH MAC Enable Unicast Pause Packet Detect  */
} hal_eth_mac_uc_pause_pkt_ctrl_t;

/**
  * @brief  HAL ETH MAC Enables or disables the MAC to decodes the received Pause packet and disables its transmitter
    for a specified (Pause) time
  */
typedef enum
{
  HAL_ETH_MAC_RECEIVE_FLOW_DISABLE  = 0UL,                 /*!< ETH MAC Disable Receive Flow Control */
  HAL_ETH_MAC_RECEIVE_FLOW_ENABLE   = ETH_MACRXFCR_RFE     /*!< ETH MAC Enable Receive Flow Control  */
} hal_eth_mac_receive_flow_ctrl_t;


/**
  * @brief HAL ETH MAC Pause Low Threshold
  */
typedef enum
{
  HAL_ETH_MAC_PLT_MINUS_4_SLOT_TIME   = 0x00000000UL,      /*!< ETH MAC Pause Low Threshold Minus 4   */
  HAL_ETH_MAC_PLT_MINUS_28_SLOT_TIME  = 0x00000010UL,      /*!< ETH MAC Pause Low Threshold Minus 28  */
  HAL_ETH_MAC_PLT_MINUS_36_SLOT_TIME  = 0x00000020UL,      /*!< ETH MAC Pause Low Threshold Minus 36  */
  HAL_ETH_MAC_PLT_MINUS_144_SLOT_TIME = 0x00000030UL,      /*!< ETH MAC Pause Low Threshold Minus 144 */
  HAL_ETH_MAC_PLT_MINUS_256_SLOT_TIME = 0x00000040UL,      /*!< ETH MAC Pause Low Threshold Minus 256 */
  HAL_ETH_MAC_PLT_MINUS_512_SLOT_TIME = 0x00000050UL       /*!< ETH MAC Pause Low Threshold Minus 512 */
} hal_eth_mac_pause_low_thr_t;

/**************************************  ETH DMA Configuration Enumerations  *****************************************/

/**
  * @brief  Enables or disables the Peripheral Bus Master interface address aligned
  *         burst transfers on Read and Write channels
  */
typedef enum
{
  HAL_ETH_DMA_ADDR_ALIGN_DISABLE    = 0UL,                 /*!< ETH DMA Disable Address-Aligned Beats  */
  HAL_ETH_DMA_ADDR_ALIGN_ENABLE     = ETH_DMASBMR_AAL      /*!< ETH DMA Enable Address-Aligned Beats   */
} hal_eth_dma_addr_align_ctrl_t;

/**
  * @brief HAL ETH Burst Length Mode
  */
typedef enum
{
  HAL_ETH_DMA_BURST_LEN_FIXED       = ETH_DMASBMR_FB,      /*!< Fixed Burst Length as specified by the BLEN256,
                                                                BLEN128, BLEN64, BLEN32, BLEN16, BLEN8
                                                                or BLEN4 field */
  HAL_ETH_DMA_BURST_LEN_MAX_ALLOWED = 0x00000000UL         /*!< Burst transfers of length equal to or less than the
                                                                maximum allowed burst length */
} hal_eth_dma_burst_len_mode_t;

/**
  * @brief  ETH DMA Mixed Burst Mode Enumeration definition
  */
typedef enum
{
  HAL_ETH_DMA_MIXED_BURST_MODE_ENABLED   = ETH_DMASBMR_MB, /*!< Mixed Burst is enabled.
                                                                When this control is enabled, the BUS master performs
                                                                undefined bursts transfers (INCR) for burst length of
                                                                16 or more. For burst length of 16 or less, the BUS
                                                                master performs fixed burst transfers
                                                                (INCRx and SINGLE). */
  HAL_ETH_DMA_MIXED_BURST_MODE_DISABLED  = 0UL,            /*!<  Mixed Burst is disabled.*/
} hal_eth_dma_mixed_burst_ctrl_t;

