MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_eth.h
/**
  * @brief  ETH DMA Rebuild Increment Burst Enumeration definition
  */
typedef enum
{
  HAL_ETH_DMA_REBUILD_INC_BURST_ENABLED   = ETH_DMASBMR_RB, /*!< Rebuild INCRx Burst is enabled.
                                                                 When this control is enabled and the System Bus master
                                                                 gets SPLIT, RETRY, or Early Burst Termination (EBT)
                                                                 response, the AHB master interface rebuilds the pending
                                                                 beats of any initiated burst transfer with INCRx and
                                                                 SINGLE transfers. By default, the BUS master interface
                                                                 rebuilds the pending beats of an EBT with an
                                                                 unspecified (INCR) burst. */
  HAL_ETH_DMA_REBUILD_INC_BURST_DISABLED  = 0UL,            /*!< Rebuild INCRx Burst is disabled. For EBT/SPLIT/RETRY,
                                                                 pending beats are rebuilt using unspecified-length
                                                                 (INCR) bursts (default behavior) */
} hal_eth_dma_rebuild_inc_ctrl_t;

/**
  * @brief  DMA Transmit Priority Control enumeration.
  *
  * This enumeration controls whether the DMA gives priority to transmit operations
  * over receive operations. Enabling this can improve transmit performance in
  * scenarios where transmit latency is critical.
  */
typedef enum
{
  HAL_ETH_DMA_TR_PRIO_DISABLE       = 0UL,                 /*!< Transmit priority is disabled; receive operations are
                                                                prioritized over transmit. */
  HAL_ETH_DMA_TR_PRIO_ENABLE        = ETH_DMAMR_TXPR       /*!< Transmit priority is enabled; transmit operations are
                                                                prioritized over receive. */
} hal_eth_dma_tr_prio_ctrl_t;

/**********************************  ETH DMA Tx Channel Configuration Enumerations  **********************************/
/**
  * @brief ETH DMA Tx PBLx8 mode control enumeration definition.
  *
  * This enumeration enables or disables the multiplication by eight of the
  * programmable burst length (PBL) via the PBLX8 bit in ETH_DMACCR.
  */
typedef enum
{
  HAL_ETH_DMA_TX_PBL_X8_DISABLE     = 0UL,                 /*!< ETH TX DMA Disable 8xPBL mode */
  HAL_ETH_DMA_TX_PBL_X8_ENABLE      = ETH_DMACCR_PBLX8    /*!< ETH TX DMA Enable 8xPBL mode */
} hal_eth_dma_tx_pbl_x8_mode_ctrl_t;

/**
  * @brief HAL ETH DMA Tx Burst Length
  */
typedef enum
{
  HAL_ETH_DMA_TX_BLEN_1_BEAT        = 0x00010000UL,        /*!< DMA Transmit Programmable Burst Length = 1 beat   */
  HAL_ETH_DMA_TX_BLEN_2_BEAT        = 0x00020000UL,        /*!< DMA Transmit Programmable Burst Length = 2 beats  */
  HAL_ETH_DMA_TX_BLEN_4_BEAT        = 0x00040000UL,        /*!< DMA Transmit Programmable Burst Length = 4 beats  */
  HAL_ETH_DMA_TX_BLEN_8_BEAT        = 0x00080000UL,        /*!< DMA Transmit Programmable Burst Length = 8 beats  */
  HAL_ETH_DMA_TX_BLEN_16_BEAT       = 0x00100000UL,        /*!< DMA Transmit Programmable Burst Length = 16 beats */
  HAL_ETH_DMA_TX_BLEN_32_BEAT       = 0x00200000UL         /*!< DMA Transmit Programmable Burst Length = 32 beats */
} hal_eth_dma_tx_burst_length_t;

/**
  * @brief  Enables or disables the Operate on second Packet mode, which allows the DMA to process a second
  *         Packet of Transmit data even before obtaining the status for the first one.
  */
typedef enum
{
  HAL_ETH_DMA_TX_SEC_PKT_OP_DISABLE = 0UL,                 /*!< ETH TX DMA Disable Operate on Second Packet */
  HAL_ETH_DMA_TX_SEC_PKT_OP_ENABLE  = ETH_DMACTXCR_OSF    /*!< ETH TX DMA Enable Operate on Second Packet  */
} hal_eth_dma_tx_sec_pkt_op_ctrl_t;

/**********************************  ETH DMA Rx Channel Configuration Enumerations  **********************************/
/**
  * @brief HAL ETH DMA Rx Burst Length
  */
typedef enum
{
  HAL_ETH_DMA_RX_BLEN_1_BEAT        = 0x00010000UL,        /*!< DMA Receive Programmable Burst Length = 1 beat   */
  HAL_ETH_DMA_RX_BLEN_2_BEAT        = 0x00020000UL,        /*!< DMA Receive Programmable Burst Length = 2 beats  */
  HAL_ETH_DMA_RX_BLEN_4_BEAT        = 0x00040000UL,        /*!< DMA Receive Programmable Burst Length = 4 beats  */
  HAL_ETH_DMA_RX_BLEN_8_BEAT        = 0x00080000UL,        /*!< DMA Receive Programmable Burst Length = 8 beats  */
  HAL_ETH_DMA_RX_BLEN_16_BEAT       = 0x00100000UL,        /*!< DMA Receive Programmable Burst Length = 16 beats */
  HAL_ETH_DMA_RX_BLEN_32_BEAT       = 0x00200000UL         /*!< DMA Receive Programmable Burst Length = 32 beats */
} hal_eth_dma_rx_burst_length_t;

/**************************************  ETH MTL Configuration Enumerations  *****************************************/

/**
  * @brief HAL ETH MTL Tx Forward Status to Application
  */
typedef enum
{
  HAL_ETH_MTL_TX_FWD_STATUS_DISABLE = ETH_MTLOMR_DTXSTS,   /*!< Tx Forward Status to application Disable */
  HAL_ETH_MTL_TX_FWD_STATUS_ENABLE  = 0UL                  /*!< Tx Forward Status to application Enable  */
} hal_eth_mtl_tx_fwd_status_ctrl_t;

/**********************************  ETH MTL Tx Queue Configuration Enumerations  ************************************/
/**
  * @brief HAL ETH MTL Tx Queue Operation Mode
  */
typedef enum
{
  HAL_ETH_MTL_TX_QUEUE_ENABLED      = 0x00000008UL         /*!< Transmit Queue Enabled            */
} hal_eth_mtl_tx_ops_mode_t;

/**
  * @brief  MTL Transmit Queue Size enumeration.
  *
  * This enumeration specifies the size in bytes of the Ethernet MTL Transmit queue.
  */
typedef enum
{
  HAL_ETH_MTL_TX_QUEUE_SZ_2048_BYTE = (7UL << ETH_MTLTXQOMR_TQS_Pos), /*!< Transmit Queue Size 2048 bytes */
} hal_eth_mtl_tx_queue_size_t;

/**
  * @brief HAL ETH MTL Transmit Mode
  */
typedef enum
{
  HAL_ETH_MTL_TX_Q_STORE_AND_FORWARD  = ETH_MTLTXQOMR_TSF,    /*!< Transmit Store and Forward Mode      */
  HAL_ETH_MTL_TX_Q_THRESHOLD_32_BYTE  = 0x00000000UL,          /*!< Transmit Threshold Control 32 bytes  */
  HAL_ETH_MTL_TX_Q_THRESHOLD_64_BYTE  = 0x00000010UL,          /*!< Transmit Threshold Control 64 bytes  */
  HAL_ETH_MTL_TX_Q_THRESHOLD_96_BYTE  = 0x00000020UL,          /*!< Transmit Threshold Control 96 bytes  */
  HAL_ETH_MTL_TX_Q_THRESHOLD_128_BYTE = 0x00000030UL,          /*!< Transmit Threshold Control 128 bytes */
  HAL_ETH_MTL_TX_Q_THRESHOLD_192_BYTE = 0x00000040UL,          /*!< Transmit Threshold Control 192 bytes */
  HAL_ETH_MTL_TX_Q_THRESHOLD_256_BYTE = 0x00000050UL,          /*!< Transmit Threshold Control 256 bytes */
  HAL_ETH_MTL_TX_Q_THRESHOLD_384_BYTE = 0x00000060UL,          /*!< Transmit Threshold Control 384 bytes */
  HAL_ETH_MTL_TX_Q_THRESHOLD_512_BYTE = ETH_MTLTXQOMR_TTC     /*!< Transmit Threshold Control 512 bytes */
} hal_eth_mtl_tx_transmit_mode_t;

/**********************************  ETH MTL Rx Queue Configuration Enumerations  ************************************/
/**
  * @brief HAL ETH MTL Rx Queue Operation Mode
  */
typedef enum
{
  HAL_ETH_MTL_RX_QUEUE_ENABLED      = 0x00000002UL,        /*!< Receive Queue Enabled            */
} hal_eth_mtl_rx_ops_mode_t;

/**
  * @brief  ETH MTL Receive Queue Size enumeration.
  *
  * This enumeration specifies the size in bytes of the Ethernet MTL Receive queue.
  */
typedef enum
{
  HAL_ETH_MTL_RX_QUEUE_SZ_2048_BYTE = (7UL << ETH_MTLRXQOMR_RQS_Pos), /*!< Receive Queue Size 2048 bytes */
} hal_eth_mtl_rx_queue_size_t;

/**
  * @brief  ETH MTL Drop Checksum Error Packet Control enumeration.
  *
  * This enumeration controls whether the Ethernet MAC MTL (MAC Transmission Layer)
  * will drop received packets with checksum errors or forward them to the application.
  */
typedef enum
{
  HAL_ETH_MTL_RX_DROP_CS_ERR_DISABLE = ETH_MTLRXQOMR_DIS_TCP_EF,   /*!< TCP-IP Packets with checksum errors
                                                                         are forwarded to the application. */
  HAL_ETH_MTL_RX_DROP_CS_ERR_ENABLE  = 0UL                          /*!< TCP-IP Packets with checksum errors
                                                                         are dropped and not forwarded to the
                                                                         application. */
} hal_eth_mtl_rx_drop_cs_err_ctrl_t;

/**
  * @brief  ETH MTL Forward Error Packets Control enumeration.
  *
  * This enumeration controls whether the Ethernet MTL will forward received
  * packets that have errors to the application or discard them.
  */
typedef enum
{
  HAL_ETH_MTL_RX_FWD_ERR_PKT_DISABLE = 0UL,                         /*!< Received packets with errors are discarded
                                                                         and not forwarded to the application. */
  HAL_ETH_MTL_RX_FWD_ERR_PKT_ENABLE  = ETH_MTLRXQOMR_FEP           /*!< Received packets with errors are
                                                                         forwarded to the application. */
} hal_eth_mtl_rx_fwd_err_pkt_ctrl_t;

/**
  * @brief ETH MTL Control for forwarding received undersized good packets in the MTL RX path.
  *
  * This enumeration defines the options for handling received undersized good packets
  * in the Ethernet MAC MTL (MAC Transmission Layer) RX path. Depending on the selected
  * value, the hardware will either discard or forward such packets to the application.
  */
typedef enum
{
  HAL_ETH_MTL_RX_FWD_USZ_PKT_DISABLE = 0UL,                         /*!< Received undersized good packets are discarded
                                                                         and not forwarded to the application. */
  HAL_ETH_MTL_RX_FWD_USZ_PKT_ENABLE  = ETH_MTLRXQOMR_FUP          /*!< Received undersized good packets are forwarded
                                                                         to the application. */
} hal_eth_mtl_rx_fwd_usz_pkt_ctrl_t;

/**
  * @brief HAL ETH MTL Receive Mode
  */
typedef enum
{
  HAL_ETH_MTL_RX_Q_STORE_AND_FORWARD = ETH_MTLRXQOMR_RSF, /*!< Receive Store and Forward operating mode */
  HAL_ETH_MTL_RX_Q_THRESHOLD_64      = 0x00000000UL,       /*!< Receive Threshold Control                */
  HAL_ETH_MTL_RX_Q_THRESHOLD_32      = 0x00000001UL,       /*!< Receive Threshold Control                */
  HAL_ETH_MTL_RX_Q_THRESHOLD_96      = 0x00000002UL,       /*!< Receive Threshold Control                */
  HAL_ETH_MTL_RX_Q_THRESHOLD_128     = ETH_MTLRXQOMR_RTC  /*!< Receive Threshold Control                */
} hal_eth_mtl_rx_queue_mode_t;
