MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_eth.h
/**********************************  ETH MAC ARP Offloading Status Enumerations  *************************************/
/**
  * @brief HAL ETH MAC ARP Offloading Status
  */
typedef enum
{
  HAL_ETH_ARP_OFFLOAD_DISABLED      = 0UL,                 /*!< ETH ARP Offloading Disabled */
  HAL_ETH_ARP_OFFLOAD_ENABLED       = ETH_MACCR_ARPEN      /*!< ETH ARP Offloading Enabled */
} hal_eth_arp_offload_status_t;

/**********************************  ETH External WKUP Triggers Enumerations  ****************************************/
/**
  * @brief  Ethernet Wakeup trigger type enumeration.
  *
  * This enumeration defines the possible trigger conditions for the Ethernet
  * Wakeup External line. It is used to indicate which edge(s) have caused a pending
  * interrupt on the External line.
  */
typedef enum
{
  HAL_ETH_WAKEUP_TRIGGER_NONE           = LL_EXTI_TRIGGER_NONE,            /*!< No trigger pending */
  HAL_ETH_WAKEUP_TRIGGER_RISING         = LL_EXTI_TRIGGER_RISING,          /*!< Rising edge trigger pending */
  HAL_ETH_WAKEUP_TRIGGER_FALLING        = LL_EXTI_TRIGGER_FALLING,         /*!< Falling edge trigger pending */
  HAL_ETH_WAKEUP_TRIGGER_RISING_FALLING = LL_EXTI_TRIGGER_RISING_FALLING   /*!< Both rising and falling edge triggers
                                                                                pending */
} hal_eth_wakeup_trigger_t;

/**
  * @}
  */

/** @defgroup ETH_Exported_Types_Group2 ETH handles types definitions
  * @{
  */
/**
  * @brief HAL ETH handle type definition
  */
typedef struct hal_eth_handle_s hal_eth_handle_t;         /*!< HAL ETH handle structure type */
/**
  * @}
  */

/** @defgroup ETH_Exported_Types_Group3 ETH DMA descriptor lists types definitions
  * @{
  */
/**
  * @brief  DMA Transmit Descriptors Wrapper structure definition
  */
typedef struct
{
  uint32_t                         *p_desc_list_addr;                 /*!< Tx Descriptors Base address */
  uint32_t                          total_desc_cnt;                   /*!< TX total Number of descriptors */
  uint32_t                          desc_len_byte;                    /*!< TX Desc len in byte*/
  uint32_t                          curr_desc_id;                     /*!< TX current available Desc ID */
  uint32_t                          built_desc_id;                    /*!< TX built Desc ID */
  uint32_t                          buff_in_use;                      /*!< Buffers in Use */
} hal_eth_tx_descriptor_list_t;

/**
  * @brief  DMA Receive Descriptors Wrapper structure definition
  */
typedef struct
{
  uint32_t                         *p_desc_list_addr;                 /*!< Rx Descriptors base address */
  uint32_t                          total_desc_cnt;                   /*!< RX total Number of descriptors */
  uint32_t                          desc_len_byte;                    /*!< RX Desc len in byte*/
  uint32_t                          curr_desc_id;                     /*!< RX current available Desc */
  uint32_t                          built_desc_id;                    /*!< RX Built Desc */
  uint32_t                          buff_in_use;                      /*!< Rx Buffers in Use */
} hal_eth_rx_descriptor_list_t;
/**
  * @}
  */

/** @defgroup ETH_Exported_Types_Group4 ETH common types definitions
  * @{
  */
/**
  * @brief ETH FIFO Event Configuration structure definition
  */
typedef struct
{
  hal_eth_fifo_event_mode_t         event_mode;            /*!< ETH FIFO Event Mode */

  uint32_t                          event_params;          /*!< Event parameter. The value could be one of the
                                                                following :
                                                                  - Number of buffers to transfer by the DMA to trig
                                                                  the interruption when mode=HAL_ETH_FIFO_EVENT_CYCLIC.
                                                                  - or anything (to be ignored by the driver) when
                                                                  mode=HAL_ETH_FIFO_EVENT_ALWAYS or
                                                                  mode=HAL_ETH_FIFO_EVENT_NONE */
} hal_eth_fifo_event_config_t;

/**
  * @brief ETH Tx Callback Data structure definition
  */
typedef struct
{
  uint32_t                          status;                /*!< ETH Transmission Status.
                                                                This parameter can be a combination
                                                                of @ref ETH_Channel_Tx_Status */
  uint32_t                          errors;                /*!< ETH Transmission Errors.
                                                                This parameter can be a combination
                                                                of @ref ETH_Channel_Tx_Errors */
  void                              *p_data;               /*!< Specifies Application packet pointer */
} hal_eth_tx_cb_pkt_data_t;

/**
  * @brief ETH Rx Callback Packet Data structure definition
  */
typedef struct
{
  uint32_t                          status;                /*!< ETH Reception Status.
                                                                This parameter can be a combination
                                                                of @ref ETH_Channel_Rx_Status */
  uint32_t                          errors;                /*!< ETH Reception Errors.
                                                                This parameter can be a combination
                                                                of @ref ETH_Channel_Rx_Errors */
  void                             *p_data;                /*!< Specifies Application packet pointer */
  uint32_t                          vlan_tag_ids;          /*!< ETH Reception VLAN Tag ID.
                                                                This parameter can be a value from 0x0 to 0xFFFF */
} hal_eth_rx_cb_pkt_data_t;
/**
  * @}
  */

