MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_eth.h
/** @defgroup ETH_Exported_Types_Group5 ETH callbacks types definitions
  * @{
  */
/**
  * @brief Pointer to a function for handling Ethernet Tx completion events.
  *
  * **Function Signature**
  * ```c
  *   hal_status_t callback(hal_eth_handle_t *heth, uint32_t channel, void *p_buf,
  *                         hal_eth_tx_cb_pkt_data_t tx_pkt_data);
  * ```
  *
  * @note
  *   The @p p_tx_complete_cb callback is invoked in the following scenarios:
  *   - **Peripheral De-Initialization:** When @ref HAL_ETH_DeInit is called to de-initialize the Ethernet peripheral,
  *     all allocated buffers and their metadata are released, and the transmission path is stopped.
  *   - **Channel Stop:** When @ref HAL_ETH_StopChannel is called to stop the channel, all allocated buffers and their
  *     metadata are released, and the transmission path is stopped.
  *   - **Data Handling:** When @ref HAL_ETH_ExecDataHandler is called to process transmitted data, transmitted frames
  *     and their metadata are returned to the application.
  *
  * **Parameters:**
  *
  * | Type                         | Dir  | Name         | Description                               |
  * |------------------------------|------|--------------|-------------------------------------------|
  * | `hal_eth_handle_t *`         | [in] | heth         | Pointer to the Ethernet handle.           |
  * | `uint32_t`                   | [in] | channel      | Channel number.                           |
  * | `void *`                     | [in] | p_buf        | Pointer to the transmitted buffer.        |
  * | `hal_eth_tx_cb_pkt_data_t *` | [in] | tx_pkt_data  | Packet-specific data for the Tx callback. |
  *
  * @retval     HAL_OK       Callback executed successfully.
  * @retval     HAL_ERROR    An error occurred during callback execution.
  *
  * @note If the application does not complete the callback execution successfully, the driver's behavior will vary
  *   depending on the context:
  *   - **Peripheral De-Initialization or Channel Stop:** If the failure occurs during peripheral de-initialization or
  *     while stopping a channel, the driver will continue processing data for the affected channel and will release
  *     all resources associated with it. The application can choose to treat any unreleased resources as unusable for
  *     future Ethernet HAL driver operations.
  *   - **Data Handling:** If the failure occurs during data handling, the driver will suspend data processing for the
  *     affected channel. The index of this channel will be included in the list of output channels for which data
  *     handling was not completed (as returned by @p p_output_channel_mask parameter of @ref HAL_ETH_ExecDataHandler.
  *     To resume data handling on the affected channel, invoke the @ref HAL_ETH_ExecDataHandler API.
  *
  * @see HAL_ETH_ExecDataHandler
  * @see hal_eth_tx_cb_pkt_data_t
  * @see hal_eth_handle_t
  */
typedef hal_status_t (*hal_eth_tx_complete_cb_t)(hal_eth_handle_t *, uint32_t, void *, hal_eth_tx_cb_pkt_data_t);

/**
  * @brief Pointer to a function for handling Ethernet Rx completion events.
  *
  * **Function Signature**
  * ```c
  *   hal_status_t callback(hal_eth_handle_t *heth, uint32_t channel, void *p_buf, uint32_t size,
  *                         hal_eth_rx_cb_pkt_data_t rx_pkt_data);
  * ```
  *
  * @note
  *   The @p p_rx_complete_cb callback is invoked in the following scenarios:
  *   - **Peripheral De-Initialization:** When @ref HAL_ETH_DeInit is called to de-initialize the Ethernet peripheral,
  *     all allocated buffers and their metadata are released, and the reception path is stopped.
  *   - **Channel Stop:** When @ref HAL_ETH_StopChannel is called to stop the channel, all allocated buffers and their
  *     metadata are released, and the reception path is stopped.
  *   - **Data Handling:** When @ref HAL_ETH_ExecDataHandler is called to process received data, received frames and
  *     their metadata are returned to the application.
  *
  * **Parameters:**
  *
  * | Type                         | Dir  | Name         | Description                               |
  * |------------------------------|------|--------------|-------------------------------------------|
  * | `hal_eth_handle_t *`         | [in] | heth         | Pointer to the Ethernet handle.           |
  * | `uint32_t`                   | [in] | channel      | Channel number.                           |
  * | `void *`                     | [in] | p_buf        | Pointer to the received buffer.           |
  * | `uint32_t`                   | [in] | size         | Size of the received data in bytes.       |
  * | `hal_eth_rx_cb_pkt_data_t *` | [in] | rx_pkt_data  | Packet-specific data for the Rx callback. |
  *
  * @retval     HAL_OK       Callback executed successfully.
  * @retval     HAL_ERROR    An error occurred during callback execution.
  *
  * @note If the application does not complete the callback execution successfully, the driver's behavior will vary
  *   depending on the context:
  *   - **Peripheral De-Initialization or Channel Stop:** If the failure occurs during peripheral de-initialization or
  *     while stopping a channel, the driver will continue processing data for the affected channel and will return
  *     ownership (give back) of all resources associated with that channel to the application. The application can
  *     choose to treat any unreleased resources as unusable for future Ethernet HAL driver operations.
  *   - **Data Handling:** If the failure occurs during data handling, the driver will halt data processing for the
  *     affected channel. The index of this channel will be included in the list of output channels for which data
  *     handling was not completed (as returned by @p p_output_channel_mask parameter of @ref HAL_ETH_ExecDataHandler.
  *     To resume data handling on the affected channel, invoke the @ref HAL_ETH_ExecDataHandler API.
  *
  * @see HAL_ETH_StopChannel
  * @see HAL_ETH_ExecDataHandler
  * @see hal_eth_rx_cb_pkt_data_t
  * @see hal_eth_handle_t
  */
typedef hal_status_t (*hal_eth_rx_complete_cb_t)(hal_eth_handle_t *, uint32_t, void *, uint32_t,
                                                 hal_eth_rx_cb_pkt_data_t);

/**
  * @brief Pointer to a function for allocating buffers for Ethernet Rx operations.
  *
  * **Function Signature**
  * ```c
  *   void callback(hal_eth_handle_t *heth, uint32_t channel, uint32_t size, void **p_buf, void **p_data);
  * ```
  *
  * @note
  *   The @p p_rx_allocate_cb callback is invoked in the following scenarios:
  *   - **Channel Start:** When @ref HAL_ETH_StartChannel() is called, the callback allocates initial buffers and
  *     prepares the reception path.
  *   - **Data Handling:** When @ref HAL_ETH_ExecDataHandler() is called, the callback requests memory for upcoming
  *     reception requests.
  *
  *   **Buffer Allocation Behavior:**
  *   - For the channel start scenario, if the application does not succeed in allocating a buffer for reception,
  *     the driver will stop building the list of initial buffers for the affected channel. The maximum number of
  *     buffers to be requested, as specified by the application during channel configuration, will be reduced to the
  *     number of buffers that were successfully allocated.
  *     - *Example:* If the maximum number of buffers is set to 10 but the application is only able to allocate
  *     3 buffers, the driver will use 3 as the new maximum for that channel.
  *   - For the data handling scenario, if the application does not succeed in allocating buffers for reception,
  *     the driver will halt data handling for the affected channel. The index of this channel will appear in the list
  *     of output channels where data handling was not completed. To resume data handling on the affected channel,
  *     call the @ref HAL_ETH_ExecDataHandler() API.
  *
  *   **Reception Path Requirements:**
  *   - The driver requires at least 1 buffer to start the reception path; otherwise, the reception process will
  *     not be started.
  *   - The allocated memory must meet all constraints specified by the driver, such as memory address alignment and
  *     minimum size. These constraints are provided by the @ref HAL_ETH_GetChannelAllocNeeds API, which must be
  *     called before making the allocation request.
  *
  *   **Buffer Count Query:**
  *   - The application can check the number of initial buffers that the driver will be using for the reception path
  *     by calling @ref HAL_ETH_GetChannelBufferInUseCount() API immediately after starting the channel.
  *
  * **Parameters:**
  *
  * | Type                | Dir  | Name    | Description                                           |
  * |---------------------|------|---------|-------------------------------------------------------|
  * | `hal_eth_handle_t *`| [in] | heth    | Pointer to the Ethernet handle. @ref hal_eth_handle_t |
  * | `uint32_t`          | [in] | channel | Channel number.                                       |
  * | `uint32_t`          | [in] | size    | Required buffer size in bytes.                        |
  * | `void **`           | [out]| p_buf   | Pointer to the allocated buffer.                      |
  * | `void **`           | [out]| p_data  | Pointer to the allocated buffer metadata.             |
  *
  * @see HAL_ETH_StartChannel
  * @see HAL_ETH_ExecDataHandler
  * @see HAL_ETH_GetChannelBufferInUseCount
  * @see HAL_ETH_GetChannelAllocNeeds
  * @see hal_eth_rx_channel_config_t::max_app_buffers_num
  * @see hal_eth_handle_t
  */
typedef void (*hal_eth_rx_allocate_cb_t)(hal_eth_handle_t *, uint32_t, uint32_t, void **, void **);

#if defined(USE_HAL_ETH_REGISTER_CALLBACKS) && (USE_HAL_ETH_REGISTER_CALLBACKS == 1)
/**
  * @brief Function pointer type for Ethernet event or error callbacks.
  *
  * This type defines a pointer to a callback function that is invoked to handle
  * generic Ethernet events or errors. The callback allows the application to
  * respond to various Ethernet-related notifications, such as low power status
  * changes, data events or peripheral error conditions.
  *
  * **Function Signature**
  * ```c
  * void callback(hal_eth_handle_t *heth, uint32_t events);
  * ```
  *
  * **Parameters:**
  *
  * | Type                 | Dir   | Name    | Description                                                          |
  * |----------------------|-------|---------|----------------------------------------------------------------------|
  * | `hal_eth_handle_t *` | [in]  | heth    | Pointer to the Ethernet handle structure.                            |
  * | `uint32_t`           | [in]  | events  | 32-bit value containing a combination of event flags (bitwise ORed). |
  *
  * @note
  *   - The interpretation of `events` value depends on the context in which the callback is
  *     invoked. Typically, it can be a bitmask or an enumerated value defined elsewhere
  *     in the driver.
  *   - The callback function is invoked in handler mode; therefore, it must
  *     execute quickly and must not perform any blocking operations.
  *   - If additional processing is required, it is recommended to defer such
  *     operations to a separate task or thread.
  *
  * **Associated Function Pointers**
  *   This callback type is used to implement the following Ethernet driver callbacks:
  *   - `p_data_cb`  : ETH Data Event Callback. The callback returns a bitwise ORed
  *   value for all channels that have a data event. The list of channels is provided
  *   in @ref ETH_Channel_Identifiers.
  *
  *   - `p_error_cb` : ETH Error Callback
  *   The following Errors are supported:
  *
  *   | Event                        | Description                                         |
  *   |------------------------------|-----------------------------------------------------|
  *   | HAL_ETH_ERROR_NONE           | No error.                                           |
  *   | HAL_ETH_ERROR_FBE            | Fatal Bus Error.                                    |
  *   | HAL_ETH_ERROR_CDE            | Context Descriptor Error.                           |
  *   | HAL_ETH_ERROR_FBE_DMA_TX_RD  | Bus Fault Error during read transfer by Tx DMA      |
  *   | HAL_ETH_ERROR_FBE_DMA_TX_WR  | Bus Fault Error during write transfer by Tx DMA     |
  *   | HAL_ETH_ERROR_FBE_DMA_TX_AC  | Bus Fault Error during descriptor access by Tx DMA  |
  *   | HAL_ETH_ERROR_FBE_DMA_RX_RD  | Bus Fault Error during read transfer by Rx DMA      |
  *   | HAL_ETH_ERROR_FBE_DMA_RX_WR  | Bus Fault Error during write transfer by Rx DMA     |
  *   | HAL_ETH_ERROR_FBE_DMA_RX_AC  | Bus Fault Error during descriptor access by Rx DMA  |
  *
  *   - `p_event_cb` : ETH Event Callback.
  *   The following Peripheral Events are supported:
  *
  *   | Event                        | Description                 |
  *   |------------------------------|-----------------------------|
  *   | HAL_ETH_EVENT_MAC_RWT    | Receive Watchdog Timeout Event. |
  *   | HAL_ETH_EVENT_MAC_EXCOL  | Excessive Collisions Event.     |
  *   | HAL_ETH_EVENT_MAC_LCOL   | Late Collision Event.           |
  *   | HAL_ETH_EVENT_MAC_EXDEF  | Excessive Deferral Event.       |
  *   | HAL_ETH_EVENT_MAC_LCARR  | Loss of Carrier Event.          |
  *   | HAL_ETH_EVENT_MAC_NCARR  | No Carrier Event.               |
  *   | HAL_ETH_EVENT_MAC_TJT    | Transmit Jabber Timeout Event.  |
  *
  *   - `p_pmt_cb`   : ETH Power Management Callback
  *   The following Peripheral PMT Events are supported:
  *
  *   | Event                           | Description                     |
  *   |---------------------------------|---------------------------------|
  *   | HAL_ETH_EVENT_PMT_MAGIC_PACKET  | Magic Packet Received.          |
  *   | HAL_ETH_EVENT_PMT_RWK_PACKET    | Remote wake-up Packet Received. |
  *
  *   - `p_eee_cb`   : ETH EEE (Energy Efficient Ethernet) Callback
  *   The following Peripheral EEE/LPI Events are supported:
  *
  *   | Event                        | Description                          |
  *   |------------------------------|--------------------------------------|
  *   | HAL_ETH_EVENT_LPI_PLS_DOWN   | PHY Link Status is Down.             |
  *   | HAL_ETH_EVENT_LPI_PLS_UP     | PHY Link Status is Up.               |
  *   | HAL_ETH_EVENT_LPI_TX_LPI_ST  | Transmit LPI State Active.           |
  *   | HAL_ETH_EVENT_LPI_RX_LPI_ST  | Receive LPI State Active.            |
  *   | HAL_ETH_EVENT_LPI_TX_LPI_EN  | Transmit LPI State Entry performed.  |
  *   | HAL_ETH_EVENT_LPI_RX_LPI_EN  | Receive LPI State Entry performed.   |
  *   | HAL_ETH_EVENT_LPI_TX_LPI_EX  | Transmit LPI State Entry performed.  |
  *   | HAL_ETH_EVENT_LPI_RX_LPI_EX  | Receive LPI State Entry performed.   |
  *
  * @see hal_eth_handle_t
  * @see HAL_ETH_DataCallback
  * @see HAL_ETH_ErrorCallback
  * @see HAL_ETH_EventCallback
  * @see HAL_ETH_PMTCallback
  * @see HAL_ETH_EEECallback
  */
typedef void (*hal_eth_cb_t)(hal_eth_handle_t *, uint32_t);

/**
  * @brief Function pointer type for Ethernet wakeup event callbacks.
  *
  * This type defines a pointer to a callback function that is invoked to handle
  * Ethernet wakeup events. The callback allows the application to respond when
  * the Ethernet peripheral wakes up from a low-power state.
  *
  * **Function Signature**
  * ```c
  * void callback(hal_eth_handle_t *heth);
  * ```
  *
  * **Parameters:**
  *
  * | Type                 | Dir   | Name | Description                                 |
  * |----------------------|-------|------|---------------------------------------------|
  * | `hal_eth_handle_t *` | [in]  | heth    | Pointer to the Ethernet handle structure |
  *
  * @note
  *   - The callback function is invoked in handler mode; therefore, it must
  *     execute quickly and must not perform any blocking operations.
  *   - If additional processing is required, it is recommended to defer such
  *     operations to a separate task or thread.
  *
  * @see hal_eth_handle_t
  * @see HAL_ETH_WakeUpCallback
  */
typedef void (*hal_eth_wakeup_cb_t)(const hal_eth_handle_t *);

/**
  * @brief Function pointer type for Ethernet Tx/Rx channel event callbacks.
  *
  * This type defines a pointer to a callback function that is invoked to handle
  * events related to specific Ethernet transmit (Tx) or receive (Rx) channels.
  * The callback allows the application to respond to channel-specific notifications,
  * such as data transfer completions status or error conditions.
  *
  * **Function Signature**
  * ```c
  * void callback(hal_eth_handle_t *heth, uint32_t channel, uint32_t events);
  * ```
  *
  * **Parameters:**
  *
  * | Type                 | Dir   | Name    | Description                                                          |
  * |----------------------|-------|---------|----------------------------------------------------------------------|
  * | `hal_eth_handle_t *` | [in]  | heth    | Pointer to the Ethernet handle structure                             |
  * | `uint32_t`           | [in]  | channel | Channel number (Tx or Rx) on which the event occurred.               |
  * | `uint32_t`           | [in]  | events  | 32-bit value containing a combination of event flags (bitwise ORed). |
  *
  * @note
  *   The following events are supported:
  *
  *   | Event                       | Description                   |
  *   |-----------------------------|-------------------------------|
  *   | HAL_ETH_CH_EVENT_DMA_RBU    | Receive Buffer Unavailable.   |
  *   | HAL_ETH_CH_EVENT_DMA_TBU    | Transmit Buffer Unavailable.  |
  *   | HAL_ETH_CH_EVENT_DMA_RWT    | Receive Watchdog Timeout.     |
  *   | HAL_ETH_CH_EVENT_MTL_RX_OF  | MTL Receive Queue Overflow.   |
  *   | HAL_ETH_CH_EVENT_MTL_TX_OF  | MTL Transmit Queue Underflow. |
  *
  * @note
  *   - The callback function can be invoked in handler mode; therefore, it must
  *     execute quickly and must not perform any blocking operations.
  *   - If additional processing is required, it is recommended to defer such
  *     operations to a separate task or thread.
  *
  * @see hal_eth_handle_t
  * @see ETH_Channel_Event_Codes
  * @see HAL_ETH_TxEventCallback
  * @see HAL_ETH_RxEventCallback
  */
typedef void (*hal_eth_channel_cb_t)(hal_eth_handle_t *, uint32_t, uint32_t);

/**
  * @brief Function pointer type for Ethernet cache flush/invalidate callbacks.
  *
  * This type defines a pointer to a callback function that is invoked to handle
  * cache maintenance operations (flush or invalidate) for the Ethernet driver
  * shared memory associated with specific transmit (Tx) or receive (Rx) channel.
  * The callback allows the application to ensure data coherency between the CPU
  * and DMA by performing appropriate cache maintenance operations on the buffer.
  *
  * **Function Signature**
  * ```c
  * void callback(hal_eth_handle_t *heth, uint32_t channel, void *p_buf, uint32_t size);
  * ```
  *
  * **Parameters:**
  *
  * | Type                 | Dir   | Name    | Description                                                           |
  * |----------------------|-------|---------|-----------------------------------------------------------------------|
  * | `hal_eth_handle_t *` | [in]  | heth    | Pointer to the Ethernet handle structure                              |
  * | `uint32_t`           | [in]  | channel | Channel number (Tx or Rx) for which the cache operation is performed. |
  * | `void *`             | [in]  | p_buf   | Pointer to the data buffer that requires cache flush or invalidate.   |
  * | `uint32_t`           | [in]  | size    | Size of the data buffer in bytes.                                     |
  *
  * @note
  *   - Proper cache maintenance is essential to ensure data integrity when using
  *     cached memory.
  *   - Synchronized memory regions must be aligned to cache line boundaries, as
  *     specified by the channel configuration alignment requirements provided
  *     by the user.
  *   - The callback function can be invoked in handler mode; therefore, it must
  *     execute quickly and must not perform any blocking operations.
  *   - Cache maintenance operations must be completed before returning control to
  *     the callee, ensuring that synchronized memory is ready for the next execution.
  *   - The Invalidate() operation must be performed when ownership of the driver's
  *     shared memory is transferred to the CPU.
  *   - The Flush() operation must be performed when ownership of the driver's shared
  *     memory is transferred to the hardware. For optimal performance, consider using a
  *     CleanInvalidate instruction, as there will be no further CPU data reuse (read)
  *     until the driver's shared memory is updated (write-back) by the Ethernet DMA
  *     hardware.
  *
  * **Associated Function Pointers**
  *   This callback type is used to implement the following Ethernet driver callbacks:
  *   - `p_cache_invalidate_cb` : ETH Cache Invalidate (Peripheral to CPU direction).
  *   - `p_cache_flush_cb`      : ETH Cache Flush (CPU to Peripheral direction).
  *
  * @see hal_eth_handle_t
  * @see HAL_ETH_CacheInvalidateCallback
  * @see HAL_ETH_CacheFlushCallback
  */
typedef void (*hal_eth_cache_cb_t)(hal_eth_handle_t *, uint32_t, void *, uint32_t);
#endif /* USE_HAL_ETH_REGISTER_CALLBACKS */
/**
  * @}
  */

/** @addtogroup ETH_Exported_Types_Group2
  * @{
  */
/**
  * @brief  ETH Tx Channel Handle Structure definition
  */
typedef struct
{
  ETH_DMA_Channel_TypeDef          *p_dma_instance;        /*!< Tx/Rx DMA Instances Register base address    */

