MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_eth.h
  ETH_MTL_Queue_TypeDef            *p_mtl_instance;        /*!< Tx/Rx MTL Instances Register base address    */

  volatile hal_eth_channel_state_t  channel_state;         /*!< ETH channel state information related to
                                                                channel handle management
                                                                and also related to Tx operations */

  volatile uint32_t                 channel_lock_state;    /*!< ETH channel lock state for managing atomic
                                                                access and preventing concurrent
                                                                operations */

  hal_eth_tx_descriptor_list_t      tx_desc_list;          /*!< DMA Channel Tx descriptor wrapper: holds
                                                                all Tx descriptors
                                                                list addresses and current descriptor index  */

  hal_eth_fifo_event_config_t      fifo_event_config;      /*!< Request FIFO event Configuration for the Channel */

  uint32_t                         event_cnt;              /*!< counter of fifo events */

  /* Required Channel Callbacks */
  hal_eth_tx_complete_cb_t          p_tx_complete_cb;      /*!< ETH Tx Complete Callback     */

  /* Optional Channel Callbacks */
#if defined (USE_HAL_ETH_REGISTER_CALLBACKS) && (USE_HAL_ETH_REGISTER_CALLBACKS == 1)
  hal_eth_channel_cb_t              p_ch_event_cb;         /*!< ETH DMA Tx Event Callback    */
#endif  /* USE_HAL_ETH_REGISTER_CALLBACKS */

} hal_eth_tx_channel_handle_t;

/**
  * @brief  ETH Rx Channel Handle Structure definition
  */
typedef struct
{
  void                             *p_dma_instance;        /*!< Tx/Rx DMA Instances Register base address    */

  void                             *p_mtl_instance;        /*!< Tx/Rx MTL Instances Register base address    */

  volatile hal_eth_channel_state_t  channel_state;         /*!< ETH channel state information related to
                                                                channel handle management
                                                                and also related to Tx operations */

  volatile uint32_t                 channel_lock_state;    /*!< ETH channel lock state for managing atomic
                                                                access and preventing concurrent
                                                                operations */

  hal_eth_rx_descriptor_list_t      rx_desc_list;          /*!< DMA Channel Rx descriptor wrapper: holds
                                                                all Rx descriptors
                                                                list addresses and current descriptor index  */

  uint32_t                          rx_buff_size_byte;     /*!< Rx buffers specified in bytes
                                                              The maximum buffer size is limited to 16 Kbytes.
                                                              this field is an arg of @see hal_eth_rx_allocate_cb_t*/

  hal_eth_fifo_event_config_t       fifo_event_config;     /*!< Request FIFO event Configuration for the Channel */

  uint32_t                          event_cnt;             /*!< counter of fifo events */

  /* Mandatory Rx Channel Callbacks */
  hal_eth_rx_complete_cb_t          p_rx_complete_cb;      /*!< ETH Rx Complete Callback     */

  hal_eth_rx_allocate_cb_t          p_rx_allocate_cb;      /*!< ETH Rx Get Buffer Function   */

  /* Optional Rx Channel Callbacks */
#if defined (USE_HAL_ETH_REGISTER_CALLBACKS) && (USE_HAL_ETH_REGISTER_CALLBACKS == 1)
  hal_eth_channel_cb_t              p_ch_event_cb;         /*!< ETH DMA Rx Event Callback    */
#endif  /* USE_HAL_ETH_REGISTER_CALLBACKS */

} hal_eth_rx_channel_handle_t;

/**
  * @brief  ETH Handle Structure definition
  */
struct hal_eth_handle_s
{
  hal_eth_t                         instance;                             /*!< Peripheral instance */

  hal_eth_tx_channel_handle_t       tx_channels[ETH_NB_OF_TX_CHANNEL]; /*!< Tx Channels Handles    */

  hal_eth_rx_channel_handle_t       rx_channels[ETH_NB_OF_RX_CHANNEL]; /*!< Rx Channels Handles    */

  volatile hal_eth_state_t          global_state;                         /*!< ETH state information related to global
                                                                               Handle management */

#if defined (USE_HAL_ETH_USER_DATA) && (USE_HAL_ETH_USER_DATA == 1)
  const void                       *p_user_data;                          /*!< User data pointer */
#endif /* USE_HAL_ETH_USER_DATA */

#if defined (USE_HAL_ETH_REGISTER_CALLBACKS) && (USE_HAL_ETH_REGISTER_CALLBACKS == 1)
  hal_eth_cb_t                      p_data_cb;                            /*!< ETH Data Event Callback       */

  hal_eth_cb_t                      p_error_cb;                           /*!< ETH Error Callback            */

  hal_eth_cb_t                      p_event_cb;                           /*!< ETH Event Callback            */

  hal_eth_cb_t                      p_pmt_cb;                             /*!< ETH Power Management Callback */

  hal_eth_cb_t                      p_eee_cb;                             /*!< ETH EEE Callback              */

  hal_eth_wakeup_cb_t               p_wake_up_cb;                         /*!< ETH Wake UP Callback          */

  hal_eth_cache_cb_t                p_cache_invalidate_cb;                /*!< ETH Cache Invalidate (Peripheral to CPU
                                                                                direction) Callback.
                                                                                This callback are called AFTER
                                                                                peripheral/DMA writes. */

  hal_eth_cache_cb_t                p_cache_flush_cb;                     /*!< ETH Cache Flush (CPU to Peripheral
                                                                                direction) Callback.
                                                                                This callback are called BEFORE
                                                                                peripheral/DMA reads. */
#endif  /* USE_HAL_ETH_REGISTER_CALLBACKS */

#if defined(USE_HAL_MUTEX) && (USE_HAL_MUTEX == 1)
  hal_os_semaphore_t                semaphore;                            /*!< ETH OS semaphore               */
#endif /* USE_HAL_MUTEX */

#if defined (USE_HAL_ETH_GET_LAST_ERRORS) && (USE_HAL_ETH_GET_LAST_ERRORS == 1)
  /*! Last error codes on ETH peripheral side */
  volatile uint32_t                 last_error_codes;
#endif /* USE_HAL_USART_GET_LAST_ERRORS */
};
/**
  * @}
  */

