MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_eth.h
/** @defgroup ETH_Exported_Types_Group6 ETH peripheral configuration structures
  * @{
  */
/**
  * @brief  ETH Peripheral Configuration structure definition
  */
typedef struct
{
  uint8_t                           mac_addr[6];           /*!< MAC Address of used Hardware: must be pointer on an
                                                                array of 6 bytes */

  hal_eth_media_interface_t         media_interface;       /*!< Selects the Ethernet Media interface. */

} hal_eth_config_t;

/**
  * @brief  ETH Peripheral Auto-Negotiation Link Configuration structure definition.
  *         Auto-negotiation is a process between PHY layer devices that enables
  *         them to automatically exchange information about their capabilities,
  *         such as speed, duplex mode, and flow control. This allows both devices
  *         to select the highest performance mode supported by both ends of the
  *         link.
  *         The MAC is responsible for final Auto-Negotiation link configuration
  *         resolution after a link is established, and is responsible for correct
  *         flow control, energy efficient ethernet actions thereafter.
  */
typedef struct
{
  /* LINK Speed/Duplex configuration */
  hal_eth_mac_speed_t               speed;                 /*!< Sets the Ethernet speed: 10/100/1000 Mbps */

  hal_eth_mac_duplex_mode_t         duplex_mode;           /*!< Selects the MAC duplex mode: Half-Duplex or Full-Duplex
                                                                mode */
} hal_eth_link_config_t;
/**
  * @}
  */

/** @defgroup ETH_Exported_Types_Group7 ETH MAC - DMA - MTL Sub-Blocks configuration structures
  * @{
  */
/**
  * @brief  ETH MAC Configuration structure definition
  */
typedef struct
{
  hal_eth_link_config_t             link_config;           /*!< Sets the Ethernet Link configuration */

  hal_eth_mac_loopback_ctrl_t       loopback_mode;         /*!< Enables or disables the loopback mode */

  hal_eth_mac_src_addr_ctrl_t       src_addr_ctrl;         /*!< Selects the Source Address Insertion or Replacement
                                                                Control */

  hal_eth_mac_inter_pkt_gap_t       inter_pkt_gap_value;   /*!< Sets the minimum IPG between Packet during transmission
                                                                */

  hal_eth_mac_back_off_limit_t      back_off_limit;        /*!< Selects the BackOff limit value */

  hal_eth_mac_preeamble_length_t    preamble_length;       /*!< Selects or not the Preamble Length for Transmit packets
                                                                (Full Duplex mode) */

  hal_eth_mac_gpkt_sz_limit_ctrl_t  giant_pkt_size_limit_ctrl;  /*!< Enables or disables the Giant Packet Size Limit
                                                                Control. */

  hal_eth_mac_2k_pkt_len_ctrl_t     support_2K_pkt;        /*!< Enables or disables the IEEE 802.3as Support for 2K
                                                                length Packets */

  hal_eth_mac_crc_strip_pkt_ctrl_t  crc_strip_type_pkt;    /*!< Enables or disables the CRC stripping for Type
                                                                packets.*/

  hal_eth_mac_auto_pad_crc_s_ctrl_t auto_pad_crc_strip;    /*!< Enables or disables  the Automatic MAC Pad/CRC
                                                                Stripping.*/

  hal_eth_mac_tx_jabber_tim_ctrl_t  tx_jabber;             /*!< Enables or disables Jabber timer on Tx path.*/

  hal_eth_mac_cs_before_tr_ctrl_t   cs_before_transmit;    /*!< Enables or disables the Carrier Sense Before
                                                                Transmission in Full Duplex mode */

  hal_eth_mac_cs_during_tr_ctrl_t   cs_during_transmit;    /*!< Enables or disables the Carrier Sense During
                                                                Transmission in the Half Duplex mode */

  hal_eth_mac_retry_tr_ctrl_t       retry_transmission;    /*!< Enables or disables the MAC retry transmission, when a
                                                                collision occurs in Half Duplex mode.*/

  hal_eth_mac_rx_wd_tim_ctrl_t      rx_watchdog;           /*!< Enables or disables the Watchdog timer on Rx path.*/

  hal_eth_mac_rx_jumbo_pkt_ctrl_t   rx_jumbo_pkt;          /*!< Enables or disables receiving Jumbo
                                                                Packet
                                                                When enabled, the MAC allows jumbo packets of 9,018
                                                                bytes without reporting a giant packet error */

  hal_eth_mac_rx_csum_pkt_ctrl_t    rx_csum_offload;       /*!< Enables or Disable the checksum checking for received
                                                                packet payloads TCP, UDP or ICMP headers */

  hal_eth_mac_rx_receive_own_ctrl_t rx_receive_own;        /*!< Enables or disables the Receive Own in Half Duplex mode
                                                                */

  hal_eth_mac_rx_crc_pkt_chk_ctrl_t crc_checking_rx_pkts;  /*!< Enable or disables the CRC Checking for Received
                                                                Packets. */

  hal_eth_mac_deferral_check_ctrl_t deferral_check;        /*!< Enables or disables the deferral check function in Half
                                                                Duplex mode. */

  hal_eth_mac_uc_slow_proto_ctrl_t  uc_slow_proto_detect;  /*!< Enable or disables the Detection of Slow Protocol
                                                                Packets with unicast address. */

  hal_eth_mac_slow_proto_ctrl_t     slow_proto_detect;     /*!< Enable or disables the Slow Protocol Detection. */


  uint32_t                          giant_pkt_size_limit;  /*!< Specifies the packet size that the MAC
                                                                will declare it as Giant, If it's size is
                                                                greater than the value programmed in this field in
                                                                This parameter must be a number between
                                                                Min_Data = 0x618 (1518 byte) and
                                                                Max_Data = 0x3FFF (32 Kbyte). */

  hal_eth_mac_ex_int_pkt_gap_ctrl_t ext_inter_pkt_gap_ctrl; /*!< Enable or disables the extended inter packet gap. */

  uint32_t                          ext_inter_pkt_gap;     /*!< Sets the Extended IPG between Packet
                                                                during transmission.
                                                                This parameter can be a value from 0x0 to 0xFF */

  hal_eth_mac_prog_wd_ctrl_t        programmable_wd;       /*!< Enable or disables the Programmable Watchdog. */

  hal_eth_mac_rx_wd_timeout_t       rx_wd_timeout_byte;    /*!< This field is used as watchdog timeout for a received
                                                                packet */

