MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_eth.h
  uint32_t                          tx_pause_time;         /*!< This field holds the value to be used in
                                                                the Pause Time field in the transmit
                                                                control packet.
                                                                This parameter must be a number between
                                                                Min_Data = 0x0 and Max_Data = 0xFFFF.*/

  hal_eth_mac_zero_q_pause_ctrl_t   zero_quanta_pause;     /*!< Enable or disables the automatic generation of Zero
                                                                Quanta Pause Control packets. */

  hal_eth_mac_pause_low_thr_t       pause_low_threshold;   /*!< This field configures the threshold of the PAUSE to be
                                                                checked for automatic retransmission of PAUSE Packet */

  hal_eth_mac_tr_flow_ctrl_t        tr_flow_ctrl;          /*!< Enables or disables the MAC to transmit
                                                                Pause packets in Full Duplex mode
                                                                or the MAC back pressure operation in Half Duplex
                                                                mode */

  hal_eth_mac_uc_pause_pkt_ctrl_t   uc_pause_pkt_detect;   /*!< Enables or disables the MAC to detect Pause packets
                                                                with unicast address of the station */

  hal_eth_mac_receive_flow_ctrl_t   receive_flow_ctrl;     /*!< Enables or disables the MAC to decodes
                                                                the received Pause packet
                                                                and disables its transmitter for a specified (Pause)
                                                                time */
} hal_eth_mac_config_t;

/**
  * @brief  ETH DMA Configuration Structure definition
  */
typedef struct
{
  hal_eth_dma_addr_align_ctrl_t     addr_aligned_beats;    /*!< Enables or disables the Peripheral Bus
                                                                Master interface address aligned burst transfers
                                                                on Read and Write channels  */

  hal_eth_dma_burst_len_mode_t      burst_mode;            /*!< Sets the Peripheral Bus Master interface burst
                                                                transfers length mode */
  hal_eth_dma_mixed_burst_ctrl_t    mixed_burst;           /*!< Sets the maximum outstanding request on the System Bus
                                                                read interface */

  hal_eth_dma_rebuild_inc_ctrl_t    rebuild_inc_burst;     /*!< Sets the maximum outstanding request on the System Bus
                                                                read interface */

  hal_eth_dma_tr_prio_ctrl_t        tr_priority;           /*!< Sets Transmit priority over Receive */

} hal_eth_dma_config_t;

/**
  * @brief  ETH DMA Tx Configuration Structure definition
  */
typedef struct
{
  hal_eth_dma_tx_pbl_x8_mode_ctrl_t tx_pbl_x8_mode;        /*!< Enables or disables the PBL multiplication by eight. */

  hal_eth_dma_tx_burst_length_t     tx_dma_burst_length;   /*!< Indicates the maximum number of beats to be transferred
                                                                in one Tx DMA transaction */

  hal_eth_dma_tx_sec_pkt_op_ctrl_t  tx_second_pkt_operate; /*!< Enables or disables the Operate on second
                                                                Packet mode, which allows the DMA to
                                                                process a second
                                                                Packet of Transmit data even before obtaining the
                                                                status for the first one. */

} hal_eth_dma_tx_channel_config_t;

/**
  * @brief  ETH DMA Rx Configuration Structure definition
  */
typedef struct
{
  hal_eth_dma_rx_burst_length_t     rx_dma_burst_length;   /*!< Indicates the maximum number of beats to be transferred
                                                                in one Rx DMA transaction */

  uint32_t                          rx_buffer_len_byte;    /*!< Provides the length of Rx buffers size in byte unit */

} hal_eth_dma_rx_channel_config_t;

/**
  * @brief  ETH MTL Configuration Structure definition
  */
typedef struct
{
  hal_eth_mtl_tx_fwd_status_ctrl_t  tx_fwd_status;         /*!< Enables or disables forwarding Tx Packet Status to the
                                                                application. */

} hal_eth_mtl_config_t;

/**
  * @brief  ETH MTL Tx Queue Configuration Structure definition
  */
typedef struct
{
  hal_eth_mtl_tx_ops_mode_t         queue_op_mode;         /*!< Specifies the Tx Queue operating mode */

  hal_eth_mtl_tx_queue_size_t       queue_size_byte;       /*!< Specifies the Tx Queue Size */

  hal_eth_mtl_tx_transmit_mode_t    transmit_queue_mode;   /*!< Specifies the Transmit Queue operating mode */

} hal_eth_mtl_tx_queue_config_t;

/**
  * @brief  ETH MTL Rx Queue Configuration Structure definition
  */
typedef struct
{
  hal_eth_mtl_rx_ops_mode_t         queue_op_mode;         /*!< Specifies the Rx Queue operating mode */

  hal_eth_mtl_rx_queue_size_t       queue_size_byte;       /*!< Specifies the Rx Queue Size */

  hal_eth_mtl_rx_drop_cs_err_ctrl_t drop_tcp_ip_csum_error_pkt; /*!< Enables or disables Dropping of TCPIP Checksum
                                                                     Error Packets */

  hal_eth_mtl_rx_fwd_err_pkt_ctrl_t fwd_error_pkt;         /*!< Enables or disables  forwarding Error Packets. */

  hal_eth_mtl_rx_fwd_usz_pkt_ctrl_t fwd_undersized_good_pkt; /*!< Enables or disables  forwarding Undersized Good
                                                                  Packets.*/

  hal_eth_mtl_rx_queue_mode_t       receive_queue_mode;    /*!< Specifies the Receive Queue operating mode */
} hal_eth_mtl_rx_queue_config_t;
/**
  * @}
  */

/** @defgroup ETH_Exported_Types_Group8 ETH channels configuration structures
  * @{
  */
/**
  * @brief  ETH Tx Channel Configuration Structure definition
  */
typedef struct
{
  uint32_t                          max_app_buffers_num;   /*!< Provides the Maximum number of Application Buffers to
                                                                be hold in the DMA FIFO */

  uint32_t                          req_desc_size_align_byte; /*!< Provides the Application requested memory size
                                                                   alignment in bytes.
                                                                   The application can request specific memory size
                                                                   alignment to implement proper CACHE maintenance
                                                                   @see hal_eth_cache_cb_t callback.
                                                                   - If the requested size alignment is zero then the
                                                                   driver request the alignment according to its own
                                                                   constraints.
                                                                   - Otherwise, the driver will use size alignment
                                                                   value which respect both descriptor size alignment
                                                                   and requested size alignment conditions. */

