MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_eth.h
  hal_eth_dma_tx_channel_config_t   dma_channel_config;    /*!< DMA Tx Channel Configuration */

  hal_eth_mtl_tx_queue_config_t     mtl_queue_config;      /*!< MTL Tx Queue Configuration */

  hal_eth_fifo_event_config_t       fifo_event_config;     /*!< FIFO event Configuration */

} hal_eth_tx_channel_config_t;

/**
  * @brief  ETH Rx Channel Configuration Structure definition
  */
typedef struct
{
  uint32_t                          max_app_buffers_num;   /*!< Provides the Maximum number of Application Buffers to
                                                                be hold in the DMA FIFO */

  uint32_t                          req_desc_size_align_byte; /*!< Provides the Application requested
                                                                   descriptor memory size alignment in
                                                                   bytes.
                                                                   The application can request specific descriptor size
                                                                   alignment to implement proper CACHE maintenance
                                                                   @see hal_eth_cache_cb_t callback.
                                                                   - If the requested size alignment is zero then the
                                                                   driver will not align the descriptor size.
                                                                   - Otherwise, the driver will use size alignment
                                                                   value which respect both descriptor size alignment
                                                                   and requested size aligenement conditions. */

  hal_eth_dma_rx_channel_config_t   dma_channel_config;    /*!< DMA Rx Channel Configuration */

  hal_eth_mtl_rx_queue_config_t     mtl_queue_config;      /*!< MTL Rx Queue Configuration */

  hal_eth_fifo_event_config_t       fifo_event_config;     /*!< FIFO event Configuration */

} hal_eth_rx_channel_config_t;

/**
  * @brief  ETH Channel Memory Allocation Requirements Structure definition
  */
typedef struct
{
  uint32_t                          mem_size_byte;         /*!< Provides the minimal Size required by the driver */

  uint32_t                          mem_addr_align_byte;   /*!< Provides the minimum alignment for memory to be used by
                                                                the driver */

} hal_eth_channel_alloc_needs_t;

/**
  * @brief  ETH Buffers List structure definition
  */
typedef struct
{
  void                             *p_buffer;              /*!< The ETH Frame buffer memory */

  uint32_t                          len_byte;              /*!< The ETH Frame buffer length in bytes */

} hal_eth_buffer_t;
/**
  * @}
  */

/** @defgroup ETH_Exported_Types_Group9 ETH channels process and I/O structures
  * @{
  */
/**
  * @brief  Transmit Packet Configuration structure definition
  */
typedef struct
{
  uint32_t                          attributes;            /*!< Tx packet HW features capabilities.
                                                                This parameter can be a combination
                                                                of @ref ETH_Tx_Packet_Control_Attributes */

  hal_eth_tx_pkt_src_addr_ctrl_t    src_addr_ctrl;         /*!< Specifies the source address insertion control */

  hal_eth_tx_pkt_crc_pad_ctrl_t     crc_pad_ctrl;          /*!< Specifies the CRC and Pad insertion and replacement
                                                                control */

  hal_eth_tx_pkt_csum_ctrl_t        csum_ctrl;             /*!< Specifies the checksum insertion control */

  uint16_t                          vlan_tag_id;           /*!< Sets VLAN Tag ID only when VLAN is
                                                                enabled.
                                                                This parameter can be a value from 0x0 to 0xFFFF */

  hal_eth_tx_pkt_vlan_ctrl_t        vlan_ctrl;             /*!< Specifies VLAN Tag insertion control only when VLAN is
                                                                enabled */

  uint32_t                          inner_vlan_tag_id;     /*!< Sets Inner VLAN Tag ID only when Inner
                                                                VLAN is enabled.
                                                                This parameter can be a value from 0x0 to 0x3FFFF */

  hal_eth_tx_pkt_inner_vlan_ctrl_t  inner_vlan_ctrl;       /*!< Specifies Inner VLAN Tag insertion control only when
                                                                Inner VLAN is enabled */

  void                             *p_data;                /*!< Specifies Application packet pointer to save for
                                                                completion notification */

  hal_eth_tx_pkt_notify_ctrl_t      notify;                /*!< Enable or Disable notification for this packet transmit
                                                                request */

} hal_eth_tx_pkt_config_t;
/**
  * @}
  */

/** @defgroup ETH_Exported_Types_Group10 ETH peripheral power management structures
  * @{
  */
/**
  * @brief ETH Remote Wakeup Packet Filter structure definition.
  *
  * This structure defines a single remote wakeup packet filter used by the Ethernet peripheral.
  * Each filter can be configured to match specific packet patterns and control the filter logic
  * using a combination of mask, offset, CRC, and command bits.
  *
  * The 4-bit command field uses the following constants to control filter behavior:
  *   - @ref HAL_ETH_RWK_FLT_CMD_ENABLE         : Enable or disable the filter.
  *   - @ref HAL_ETH_RWK_FLT_CMD_AND_PREVIOUS   : AND logic with the previous filter for extended pattern matching.
  *   - @ref HAL_ETH_RWK_FLT_CMD_INVERSE_MODE   : Inverse mode for CRC16 hash function (reject on match).
  *   - @ref HAL_ETH_RWK_FLT_CMD_MULTICAST      : Apply filter to multicast or unicast packets.
  *
  * @see HAL_ETH_RWK_FLT_CMD_ENABLE
  * @see HAL_ETH_RWK_FLT_CMD_AND_PREVIOUS
  * @see HAL_ETH_RWK_FLT_CMD_INVERSE_MODE
  * @see HAL_ETH_RWK_FLT_CMD_MULTICAST
  * @see HAL_ETH_SetRemoteWakeUpPcktFilter
  */
typedef struct
{
  /**
    * @brief Filter 32-bit Mask.
    *
    * Each bit in the mask corresponds to one byte in the detected packet.
    * - If a bit is set to 1, the corresponding byte is included in the CRC16 calculation.
    * - The MSB (31st bit) must be zero.
    * - Bits [30:0] represent the byte mask.
    * - If bit j is set, the CRC block processes the (offset + j)th byte of the incoming packet.
    *   Otherwise, that byte is ignored.
    */
  uint32_t                          byte_mask;

  /**
    * @brief Filter 4-bit command stored in bits [3:0].
    *
    * The 4-bit command controls the filter operation:
    * - Bit 3 (@ref HAL_ETH_RWK_FLT_CMD_MULTICAST): Address type. Set for multicast, reset for unicast.
    * - Bit 2 (@ref HAL_ETH_RWK_FLT_CMD_INVERSE_MODE): Inverse mode. Set to reject packets with matching CRC16.
    * - Bit 1 (@ref HAL_ETH_RWK_FLT_CMD_AND_PREVIOUS): AND logic with previous filter for extended patterns.
    * - Bit 0 (@ref HAL_ETH_RWK_FLT_CMD_ENABLE): Enable filter. If not set, the filter is disabled.
    *
    * Use the defined constants to set or clear these bits.
    */
  uint8_t                           commands;

  /**
    * @brief Filter 8-bit Offset pattern.
    *
    * Defines the offset (within the packet) from which the filter examines the bytes.
    * - This 8-bit value is the offset for the filter's first byte to be examined.
    * - The minimum allowed offset is 12 (refers to the 13th byte of the packet).
    * - An offset value of 0 refers to the first byte of the packet.
    */
  uint8_t                           offsets;

  /**
    * @brief Filter CRC-16 value.
    *
    * Contains the CRC-16 value calculated from the pattern and the byte mask.
    * - The 16-bit CRC calculation uses the polynomial: G(x) = x^16 + x^15 + x^2 + 1.
    * - Each filter compares the computed CRC16 with this value for packet matching.
    * - The mask and offset together determine which bytes are used in the CRC16 calculation.
    */
  uint16_t                          crc16;

} hal_eth_rwk_pkt_filter_t;

/**
  * @brief ETH Remote Wakeup Packet Filter Block structure definition.
  *
  * This structure represents a block of remote wakeup packet filters for the Ethernet peripheral.
  * Each block contains a fixed number of filters, as defined by @ref HAL_ETH_RWK_FILT_PER_BLOCK.
  *
  * The hardware arranges remote wake-up filters in blocks, with each block containing four filters.
  * Each filter is described by @ref hal_eth_rwk_pkt_filter_t and can be individually configured.
  *
  * **Register Layout for Each Block:**
  * @code
  * | Register Name      | Description                                             |
  * |--------------------|--------------------------------------------------------|
  * | BYTE MASK (0)      | Filter #0 byte mask  [30:0]                            |
  * | BYTE MASK (1)      | Filter #1 byte mask  [30:0]                            |
  * | BYTE MASK (2)      | Filter #2 byte mask  [30:0]                            |
  * | BYTE MASK (3)      | Filter #3 byte mask  [30:0]                            |
  * | FILT_CMDS [0..3]   | FILT_3 CMD | FILT_2 CMD | FILT_1 CMD | FILT_0 CMD      |
  * | FILT_OFFSET [0..3] | FILT_3 OFFSET | FILT_2 OFFSET | FILT_1 OFFSET | FILT_0 OFFSET |
  * | FILT_CRC [1..0]    | FILT_1 CRC 16bits | FILT_0 CRC 16bits                  |
  * | FILT_CRC [3..2]    | FILT_3 CRC 16bits | FILT_2 CRC 16bits                  |
  * @endcode
  *
  * - The number of filters per block is defined by @ref HAL_ETH_RWK_FILT_PER_BLOCK.
  * - The maximum number of filter blocks is defined by @ref HAL_ETH_RWK_FILT_BLOCK_NUM.
  * - Each filter in the block uses the command constants:
  *   - @ref HAL_ETH_RWK_FLT_CMD_ENABLE
  *   - @ref HAL_ETH_RWK_FLT_CMD_AND_PREVIOUS
  *   - @ref HAL_ETH_RWK_FLT_CMD_INVERSE_MODE
  *   - @ref HAL_ETH_RWK_FLT_CMD_MULTICAST
  *
  * @see hal_eth_rwk_pkt_filter_t
  * @see HAL_ETH_RWK_FILT_PER_BLOCK
  * @see HAL_ETH_RWK_FILT_BLOCK_NUM
  * @see HAL_ETH_RWK_FLT_CMD_ENABLE
  * @see HAL_ETH_RWK_FLT_CMD_AND_PREVIOUS
  * @see HAL_ETH_RWK_FLT_CMD_INVERSE_MODE
  * @see HAL_ETH_RWK_FLT_CMD_MULTICAST
  * @see HAL_ETH_SetRemoteWakeUpPcktFilter
  */
typedef struct
{
  /**
    * @brief Array of remote wakeup packet filters in this block.
    *
    * Each filter is defined by @ref hal_eth_rwk_pkt_filter_t and can be individually configured.
    * The number of filters in the block is given by @ref HAL_ETH_RWK_FILT_PER_BLOCK.
    */
  hal_eth_rwk_pkt_filter_t          filter[HAL_ETH_RWK_FILT_PER_BLOCK];
} hal_eth_rwk_filter_block_t;

/**
  * @brief ETH Remote Wakeup Packet Filters Lookup Table (LUT) structure definition.
  *
  * This structure represents the lookup table (LUT) for all remote wakeup packet filter blocks
  * supported by the Ethernet peripheral. Each LUT contains one or more filter blocks, and each
  * block contains multiple filters.
  *
  * The number of filter blocks in the LUT is defined by @ref HAL_ETH_RWK_FILT_BLOCK_NUM.
  * Each block is represented by @ref hal_eth_rwk_filter_block_t, which contains
  * @ref HAL_ETH_RWK_FILT_PER_BLOCK filters of type @ref hal_eth_rwk_pkt_filter_t.
  *
  * **LUT Layout for N Blocks:**
  * @code
  * |--------------------------|-----------------------------------------------|
  * |      Filter Block #0     | Data for block 0 (see @ref hal_eth_rwk_filter_block_t) |
  * |--------------------------|-----------------------------------------------|
  * |      Filter Block #1     | Data for block 1                              |
  * |--------------------------|-----------------------------------------------|
  * |           ...            | ...                                           |
  * |--------------------------|-----------------------------------------------|
  * |      Filter Block #N     | Data for block N                              |
  * |--------------------------|-----------------------------------------------|
  * @endcode
  *
  * - The maximum number of filter blocks is defined by @ref HAL_ETH_RWK_FILT_BLOCK_NUM.
  * - The total number of filters supported is
  *   @ref HAL_ETH_RWK_FILT_PER_BLOCK * @ref HAL_ETH_RWK_FILT_BLOCK_NUM.
  * - Each filter uses the command constants:
  *   - @ref HAL_ETH_RWK_FLT_CMD_ENABLE
  *   - @ref HAL_ETH_RWK_FLT_CMD_AND_PREVIOUS
  *   - @ref HAL_ETH_RWK_FLT_CMD_INVERSE_MODE
  *   - @ref HAL_ETH_RWK_FLT_CMD_MULTICAST
  *
  * @see hal_eth_rwk_filter_block_t
  * @see hal_eth_rwk_pkt_filter_t
  * @see HAL_ETH_RWK_FILT_BLOCK_NUM
  * @see HAL_ETH_RWK_FILT_PER_BLOCK
  * @see HAL_ETH_RWK_FLT_CMD_ENABLE
  * @see HAL_ETH_RWK_FLT_CMD_AND_PREVIOUS
  * @see HAL_ETH_RWK_FLT_CMD_INVERSE_MODE
  * @see HAL_ETH_RWK_FLT_CMD_MULTICAST
  * @see HAL_ETH_SetRemoteWakeUpPcktFilter
  */
typedef struct
{
  /**
    * @brief Filter block 0.
    *
    * Each block is defined by @ref hal_eth_rwk_filter_block_t and contains
    * @ref HAL_ETH_RWK_FILT_PER_BLOCK filters.
    *
    * @note For hardware supporting multiple blocks, additional block members
    *       (e.g., block1, block2, ...) must be added up to
    *       @ref HAL_ETH_RWK_FILT_BLOCK_NUM.
    */
  hal_eth_rwk_filter_block_t        block0;
} hal_eth_rwk_filter_lut_t;
/**
  * @}
  */

/**
  * @}
  */

/* Exported functions --------------------------------------------------------*/
/** @defgroup ETH_Exported_Functions HAL ETH functions
  * @{
  */
/** @defgroup ETH_Exported_Functions_Group1 ETH initialization and deInitialization functions
  * @{
  */
hal_status_t HAL_ETH_Init(hal_eth_handle_t *heth, hal_eth_t instance);
void HAL_ETH_DeInit(hal_eth_handle_t *heth);
/**
  * @}
  */

/** @defgroup ETH_Exported_Functions_Group2 ETH peripheral configuration functions
  * @{
  */
hal_status_t HAL_ETH_SetConfig(hal_eth_handle_t *heth, const hal_eth_config_t *p_config);
void HAL_ETH_GetConfig(const hal_eth_handle_t *heth, hal_eth_config_t *p_config);
/**
  * @}
  */

/** @defgroup ETH_Exported_Functions_Group3 ETH peripheral sub-blocks configuration functions
  * @{
  */
void HAL_ETH_MAC_GetConfig(const hal_eth_handle_t *heth, hal_eth_mac_config_t *p_macconf);
hal_status_t HAL_ETH_MAC_SetConfig(hal_eth_handle_t *heth, const hal_eth_mac_config_t *p_macconf);
void HAL_ETH_DMA_GetConfig(const hal_eth_handle_t *heth, hal_eth_dma_config_t *p_dmaconf);
hal_status_t HAL_ETH_DMA_SetConfig(hal_eth_handle_t *heth, const hal_eth_dma_config_t *p_dmaconf);
void HAL_ETH_MTL_GetConfig(const hal_eth_handle_t *heth, hal_eth_mtl_config_t *p_mtlconf);
hal_status_t HAL_ETH_MTL_SetConfig(hal_eth_handle_t *heth, const hal_eth_mtl_config_t *p_mtlconf);
/**
  * @}
  */

