MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_eth.h
/** @defgroup ETH_Exported_Functions_Group4 ETH channels configuration functions
  * @{
  */
hal_status_t HAL_ETH_SetConfigTxChannel(hal_eth_handle_t *heth, uint32_t channel,
                                        const hal_eth_tx_channel_config_t *p_chconf);
hal_status_t HAL_ETH_SetConfigRxChannel(hal_eth_handle_t *heth, uint32_t channel,
                                        const hal_eth_rx_channel_config_t *p_chconf);
void HAL_ETH_GetConfigTxChannel(const hal_eth_handle_t *heth, uint32_t channel,
                                hal_eth_tx_channel_config_t *p_chconf);
void HAL_ETH_GetConfigRxChannel(const hal_eth_handle_t *heth, uint32_t channel,
                                hal_eth_rx_channel_config_t *p_chconf);
void HAL_ETH_GetChannelAllocNeeds(const hal_eth_handle_t *heth, uint32_t channel,
                                  hal_eth_channel_alloc_needs_t *p_ch_alloc_req);
/**
  * @}
  */

/** @defgroup ETH_Exported_Functions_Group5 ETH peripheral optional control functions
  * @{
  */
hal_status_t                 HAL_ETH_UpdateConfigLink(hal_eth_handle_t *heth, const hal_eth_link_config_t *p_config);
void                         HAL_ETH_EnableARPOffload(hal_eth_handle_t *heth);
void                         HAL_ETH_DisableARPOffload(hal_eth_handle_t *heth);
hal_eth_arp_offload_status_t HAL_ETH_IsEnabledARPOffload(const hal_eth_handle_t *heth);
void                         HAL_ETH_SetARPTargetIP(hal_eth_handle_t *heth, uint32_t tpa);
hal_status_t                 HAL_ETH_EnterPowerDownMode(hal_eth_handle_t *heth, uint32_t pmt_ctrl);
hal_status_t                 HAL_ETH_ExitPowerDownMode(hal_eth_handle_t *heth);
hal_status_t                 HAL_ETH_SetRemoteWakeUpPcktFilter(const hal_eth_handle_t *heth,
                                                               const hal_eth_rwk_filter_lut_t *p_filter_lut);
void                         HAL_ETH_EnterLPIMode(hal_eth_handle_t *heth, uint32_t lpi_ctrl);
void                         HAL_ETH_ExitLPIMode(hal_eth_handle_t *heth);
/**
  * @}
  */

/** @defgroup ETH_Exported_Functions_Group6 callbacks register functions
  * @{
  */
hal_status_t HAL_ETH_RegisterChannelRxAllocateCallback(hal_eth_handle_t *heth, uint32_t channel,
                                                       hal_eth_rx_allocate_cb_t p_callback);
hal_status_t HAL_ETH_RegisterChannelRxCptCallback(hal_eth_handle_t *heth, uint32_t channel,
                                                  hal_eth_rx_complete_cb_t p_callback);
hal_status_t HAL_ETH_RegisterChannelTxCptCallback(hal_eth_handle_t *heth, uint32_t channel,
                                                  hal_eth_tx_complete_cb_t p_callback);
#if defined (USE_HAL_ETH_REGISTER_CALLBACKS) && (USE_HAL_ETH_REGISTER_CALLBACKS == 1)
hal_status_t HAL_ETH_RegisterDataCallback(hal_eth_handle_t *heth, hal_eth_cb_t p_callback);
hal_status_t HAL_ETH_RegisterWKUPCallback(hal_eth_handle_t *heth, hal_eth_wakeup_cb_t p_callback);
hal_status_t HAL_ETH_RegisterPMTCallback(hal_eth_handle_t *heth, hal_eth_cb_t p_callback);
hal_status_t HAL_ETH_RegisterEEECallback(hal_eth_handle_t *heth, hal_eth_cb_t p_callback);
hal_status_t HAL_ETH_RegisterErrorCallback(hal_eth_handle_t *heth, hal_eth_cb_t p_callback);
hal_status_t HAL_ETH_RegisterEventCallback(hal_eth_handle_t *heth, hal_eth_cb_t p_callback);
hal_status_t HAL_ETH_RegisterCacheInvalidateCallback(hal_eth_handle_t *heth, hal_eth_cache_cb_t p_callback);
hal_status_t HAL_ETH_RegisterCacheFlushCallback(hal_eth_handle_t *heth, hal_eth_cache_cb_t p_callback);
hal_status_t HAL_ETH_RegisterChannelRxEventCallback(hal_eth_handle_t *heth, uint32_t channel,
                                                    hal_eth_channel_cb_t p_callback);
hal_status_t HAL_ETH_RegisterChannelTxEventCallback(hal_eth_handle_t *heth, uint32_t channel,
                                                    hal_eth_channel_cb_t p_callback);
#endif /* USE_HAL_ETH_REGISTER_CALLBACKS */
/**
  * @}
  */

/** @defgroup ETH_Exported_Functions_Group7 interrupts management functions
  * @{
  */
void         HAL_ETH_IRQHandler(hal_eth_handle_t *heth);
void         HAL_ETH_WKUP_IRQHandler(const hal_eth_handle_t *heth);
/**
  * @}
  */

/** @defgroup ETH_Exported_Functions_Group8 Weak callback functions
  * @{
  */
void         HAL_ETH_DataCallback(hal_eth_handle_t *heth, uint32_t channels_mask);
void         HAL_ETH_ErrorCallback(hal_eth_handle_t *heth, uint32_t errors);
void         HAL_ETH_EventCallback(hal_eth_handle_t *heth, uint32_t events);
void         HAL_ETH_PMTCallback(hal_eth_handle_t *heth, uint32_t wake_up_event);
void         HAL_ETH_EEECallback(hal_eth_handle_t *heth, uint32_t lpi_event);
void         HAL_ETH_WakeUpCallback(const hal_eth_handle_t *heth);
void         HAL_ETH_CacheInvalidateCallback(hal_eth_handle_t *heth, uint32_t channel, void *p_addr,  uint32_t size);
void         HAL_ETH_CacheFlushCallback(hal_eth_handle_t *heth, uint32_t channel, void *p_addr,  uint32_t size);
void         HAL_ETH_TxEventCallback(hal_eth_handle_t *heth, uint32_t channel, uint32_t events);
void         HAL_ETH_RxEventCallback(hal_eth_handle_t *heth, uint32_t channel, uint32_t events);
/**
  * @}
  */

/** @defgroup ETH_Exported_Functions_Group9 Process and I/O operations functions
  * @{
  */
/* ETH Peripheral I/O functions  **********************************************/
hal_status_t HAL_ETH_ExecDataHandler(hal_eth_handle_t *heth, uint32_t input_channel_mask,
                                     uint32_t *p_output_channel_mask);
/* ETH Channels I/O functions  **********************************************/
hal_status_t HAL_ETH_RequestTx(hal_eth_handle_t *heth, uint32_t channel, hal_eth_buffer_t *p_buff_array,
                               uint32_t buf_count, hal_eth_tx_pkt_config_t *p_tx_conf);
hal_status_t HAL_ETH_StartChannel(hal_eth_handle_t *heth, uint32_t channel, uint32_t *p_desc_mem,
                                  uint32_t desc_size_byte);
hal_status_t HAL_ETH_StopChannel(hal_eth_handle_t *heth, uint32_t channel);
hal_status_t HAL_ETH_SuspendChannel(hal_eth_handle_t *heth, uint32_t channel);
hal_status_t HAL_ETH_ResumeChannel(hal_eth_handle_t *heth, uint32_t channel);
uint32_t     HAL_ETH_GetChannelBufferInUseCount(const hal_eth_handle_t *heth, uint32_t channel);
/**
  * @}
  */

/** @defgroup ETH_Exported_Functions_Group10 Multi-Queue functions
  * @{
  */
/* Multi-Queue functions *********************************************/
uint32_t     HAL_ETH_GetRxDMAChNumber(const hal_eth_handle_t *heth);
uint32_t     HAL_ETH_GetTxDMAChNumber(const hal_eth_handle_t *heth);
uint32_t     HAL_ETH_GetRxMTLQNumber(const hal_eth_handle_t *heth);
uint32_t     HAL_ETH_GetTxMTLQNumber(const hal_eth_handle_t *heth);
/**
  * @}
  */

