MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_eth.h
/** @defgroup ETH_Exported_Functions_Group11 state and error functions
  * @{
  */
/* Peripheral State functions  ************************************************/
hal_eth_state_t          HAL_ETH_GetState(const hal_eth_handle_t *heth);
/* Channels State and Error functions  ****************************************/
hal_eth_channel_state_t  HAL_ETH_GetChannelState(const hal_eth_handle_t *heth, uint32_t channel);
#if defined (USE_HAL_ETH_GET_LAST_ERRORS) && (USE_HAL_ETH_GET_LAST_ERRORS == 1)
uint32_t                 HAL_ETH_GetLastErrorCodes(const hal_eth_handle_t *heth);
#endif /* USE_HAL_ETH_GET_LAST_ERRORS */
/**
  * @}
  */

/** @defgroup ETH_Exported_Functions_Group12 MDIO control and PHY I/O operations functions
  * @{
  */
void         HAL_ETH_MDIO_UpdateClockRange(hal_eth_handle_t *heth);
void         HAL_ETH_MDIO_SetOpAttributes(hal_eth_handle_t *heth, uint32_t cmd_attributes);
hal_status_t HAL_ETH_MDIO_C22WriteData(const hal_eth_handle_t *heth, uint8_t phy_dev_addr, uint8_t reg_addr,
                                       uint16_t data);
hal_status_t HAL_ETH_MDIO_C22ReadData(hal_eth_handle_t *heth, uint8_t phy_dev_addr, uint8_t reg_addr,
                                      uint16_t *p_data);
hal_status_t HAL_ETH_MDIO_C45WriteData(const hal_eth_handle_t *heth, uint8_t phy_addr, uint8_t dev_addr,
                                       uint16_t reg_addr,
                                       uint16_t data);
hal_status_t HAL_ETH_MDIO_C45ReadData(hal_eth_handle_t *heth, uint8_t phy_addr, uint8_t dev_addr, uint16_t reg_addr,
                                      uint16_t *p_data);
hal_status_t HAL_ETH_MDIO_C45ReadDataRange(hal_eth_handle_t *heth, uint8_t phy_addr, uint8_t dev_addr,
                                           uint16_t start_reg_addr,
                                           uint16_t *p_data, uint16_t count);
/**
  * @}
  */

#if defined(USE_HAL_MUTEX) && (USE_HAL_MUTEX == 1)
/** @defgroup ETH_Exported_Functions_Group13 bus operation functions
  * @{
  */
hal_status_t HAL_ETH_AcquireBus(hal_eth_handle_t *heth, uint32_t timeout_ms);
hal_status_t HAL_ETH_ReleaseBus(hal_eth_handle_t *heth);
/**
  * @}
  */
#endif /* USE_HAL_MUTEX */

#if defined (USE_HAL_ETH_USER_DATA) && (USE_HAL_ETH_USER_DATA == 1)
/** @defgroup ETH_Exported_Functions_Group14 user data functions
  * @{
  */
void        HAL_ETH_SetUserData(hal_eth_handle_t *heth, const void *p_user_data);
const void *HAL_ETH_GetUserData(const hal_eth_handle_t *heth);
/**
  * @}
  */
#endif /* USE_HAL_ETH_USER_DATA */

/** @defgroup ETH_Exported_Functions_Group15 ETH external WAKEUP management functions
  * @{
  */
/**
  * @brief  Enable the Ethernet Wakeup External interrupt.
  *
  * This function enables the interrupt request for the Ethernet Wakeup External line
  * by setting the corresponding bit in the External Interrupt Mask Register 2 (IMR2).
  * It uses an atomic operation to ensure thread safety.
  *
  * @note   This function is typically used to allow the Ethernet peripheral to
  *         wake up the MCU from low-power modes via an external interrupt.
  *
  * @note   To disable the interrupt, use @ref HAL_ETH_WAKEUP_DisableIT.
  */
__STATIC_INLINE void HAL_ETH_WAKEUP_EnableIT(void)
{
  LL_EXTI_EnableIT_32_63(ETH_WAKEUP_EXTI_LINE);
}

/**
  * @brief  Disable the Ethernet Wakeup External interrupt.
  *
  * This function disables the interrupt request for the Ethernet Wakeup External line
  * by clearing the corresponding bit in the External Interrupt Mask Register 2 (IMR2).
  *
  * @note   To enable the interrupt, use @ref HAL_ETH_WAKEUP_EnableIT.
  */
__STATIC_INLINE void HAL_ETH_WAKEUP_DisableIT(void)
{
  LL_EXTI_DisableIT_32_63(ETH_WAKEUP_EXTI_LINE);
}

/**
  * @brief  Get the interrupt pending bit for the Ethernet Wakeup External line.
  *
  * This function checks the External Rising Pending Register 2 (RPR2) and
  * Falling Pending Register 2 (FPR2) to determine which edge(s) have
  * triggered a pending interrupt for the Ethernet Wakeup External line.
  *
  * @note   The function returns one of the following values:
  *         - HAL_ETH_WAKEUP_TRIGGER_NONE: No pending trigger.
  *         - HAL_ETH_WAKEUP_TRIGGER_RISING: Rising edge trigger is pending.
  *         - HAL_ETH_WAKEUP_TRIGGER_FALLING: Falling edge trigger is pending.
  *         - HAL_ETH_WAKEUP_TRIGGER_RISING_FALLING: Both rising and falling edge triggers are pending.
  *
  * @retval hal_eth_wakeup_trigger_t
  *         The pending trigger flag(s) for the Ethernet Wakeup External line.
  */
__STATIC_INLINE hal_eth_wakeup_trigger_t HAL_ETH_WAKEUP_GetPendingIT(void)
{
  hal_eth_wakeup_trigger_t pending_edge = HAL_ETH_WAKEUP_TRIGGER_NONE;

  if (LL_EXTI_IsActiveRisingFlag_32_63(ETH_WAKEUP_EXTI_LINE) != 0UL)
  {
    /* ETH EXTI Rising edge trigger is pending */
    pending_edge = HAL_ETH_WAKEUP_TRIGGER_RISING;
  }

  if (LL_EXTI_IsActiveFallingFlag_32_63(ETH_WAKEUP_EXTI_LINE) != 0UL)
  {
    if (pending_edge == HAL_ETH_WAKEUP_TRIGGER_RISING)
    {
      pending_edge = HAL_ETH_WAKEUP_TRIGGER_RISING_FALLING;
    }
    else
    {
      pending_edge = HAL_ETH_WAKEUP_TRIGGER_FALLING;
    }
  }
  return pending_edge;
}

/**
  * @brief  Clear the pending interrupt flag(s) for the Ethernet Wakeup External line.
  *
  * This function clears the pending interrupt flag(s) for the Ethernet Wakeup External line
  * based on the specified edge(s). It writes to the External Rising Pending Register 2 (RPR2)
  * and/or Falling Pending Register 2 (FPR2) to clear the corresponding pending bits.
  *
  * @param  edge  Specifies which edge(s) to clear pending flags for.
  *               This parameter can be one or a combination of the following values:
  *               - HAL_ETH_WAKEUP_TRIGGER_RISING:   Clear rising edge pending flag.
  *               - HAL_ETH_WAKEUP_TRIGGER_FALLING:  Clear falling edge pending flag.
  *               - HAL_ETH_WAKEUP_TRIGGER_RISING_FALLING: Clear both rising and falling edge pending flags.
  */
__STATIC_INLINE void HAL_ETH_WAKEUP_ClearPendingIT(hal_eth_wakeup_trigger_t edge)
{
  if (((uint32_t)edge & (uint32_t)HAL_ETH_WAKEUP_TRIGGER_RISING) != 0UL)
  {
    /* Clear rising edge trigger pending bit */
    LL_EXTI_ClearRisingFlag_32_63(ETH_WAKEUP_EXTI_LINE);
  }

  if (((uint32_t)edge & (uint32_t)HAL_ETH_WAKEUP_TRIGGER_FALLING) != 0UL)
  {
    /* Clear falling edge trigger pending bit */
    LL_EXTI_ClearFallingFlag_32_63(ETH_WAKEUP_EXTI_LINE);
  }
}

/**
  * @brief  Enable trigger edge(s) for the Ethernet Wakeup External line.
  *
  * This function enables the specified edge trigger(s) for the Ethernet Wakeup External line
  * by setting the corresponding bits in the External Rising Trigger Selection Register 2 (RTSR2)
  * and/or Falling Trigger Selection Register 2 (FTSR2). It also clears the rising edge pending
  * bit when enabling the rising edge trigger.
  *
  * @param  edge  Specifies which edge(s) to enable as triggers.
  *               This parameter can be one or a combination of the following values:
  *               - HAL_ETH_WAKEUP_TRIGGER_RISING:   Enable rising edge trigger.
  *               - HAL_ETH_WAKEUP_TRIGGER_FALLING:  Enable falling edge trigger.
  *               - HAL_ETH_WAKEUP_TRIGGER_RISING_FALLING: Enable both rising and falling edge triggers.
  *
  * @note   To disable trigger edge(s), use @ref HAL_ETH_WAKEUP_DisableTrigger.
  */
__STATIC_INLINE void HAL_ETH_WAKEUP_EnableTrigger(hal_eth_wakeup_trigger_t edge)
{
  if (((uint32_t)edge & (uint32_t)HAL_ETH_WAKEUP_TRIGGER_RISING) != 0UL)
  {
    /* Enable rising edge trigger bit */
    LL_EXTI_EnableRisingTrig_32_63(ETH_WAKEUP_EXTI_LINE);
  }

  if (((uint32_t)edge & (uint32_t)HAL_ETH_WAKEUP_TRIGGER_FALLING) != 0UL)
  {
    /* Enable falling edge trigger bit */
    LL_EXTI_EnableFallingTrig_32_63(ETH_WAKEUP_EXTI_LINE);
  }
}

/**
  * @brief  Disable trigger edge(s) for the Ethernet Wakeup External line.
  *
  * This function disables the specified edge trigger(s) for the Ethernet Wakeup External line
  * by clearing the corresponding bits in the External Rising Trigger Selection Register 2 (RTSR2)
  * and/or Falling Trigger Selection Register 2 (FTSR2).
  *
  * @param  edge  Specifies which edge(s) to disable as triggers.
  *               This parameter can be one or a combination of the following values:
  *               - HAL_ETH_WAKEUP_TRIGGER_RISING:   Disable rising edge trigger.
  *               - HAL_ETH_WAKEUP_TRIGGER_FALLING:  Disable falling edge trigger.
  *               - HAL_ETH_WAKEUP_TRIGGER_RISING_FALLING: Disable both rising and falling edge triggers.
  *
  * @note   To enable trigger edge(s), use @ref HAL_ETH_WAKEUP_EnableTrigger.
  */
__STATIC_INLINE void HAL_ETH_WAKEUP_DisableTrigger(hal_eth_wakeup_trigger_t edge)
{
  if (((uint32_t)edge & (uint32_t)HAL_ETH_WAKEUP_TRIGGER_RISING) != 0UL)
  {
    /* Disable rising edge trigger bit */
    LL_EXTI_DisableRisingTrig_32_63(ETH_WAKEUP_EXTI_LINE);
  }

  if (((uint32_t)edge & (uint32_t)HAL_ETH_WAKEUP_TRIGGER_FALLING) != 0UL)
  {
    /* Disable falling edge trigger bit */
    LL_EXTI_DisableFallingTrig_32_63(ETH_WAKEUP_EXTI_LINE);
  }
}

/**
  * @brief  Generate a software interrupt for the Ethernet Wakeup External line.
  *
  * This function generates a software interrupt request for the Ethernet Wakeup External line
  * by setting the corresponding bit in the External Software Interrupt Event Register 2 (SWIER2).
  * This can be used to simulate an external interrupt event in software, which is useful for
  * testing or triggering interrupt handlers manually.
  *
  * @note   The software interrupt will be handled in the same way as a hardware-generated
  *         interrupt for the specified External line.
  */
__STATIC_INLINE void HAL_ETH_WAKEUP_GenerateSWIT(void)
{
  LL_EXTI_GenerateSWI_32_63(ETH_WAKEUP_EXTI_LINE);
}
/**
  * @}
  */
/**
  * @}
  */

/**
  * @}
  */

#endif /* ETH1 */

/**
  * @}
  */

#ifdef __cplusplus
}
#endif /* __cplusplus */

#endif /* STM32C5XX_HAL_ETH_H */
